
&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.Оплаты.Очистить();
	ЭтаФорма.СуммаОплат = ПолучитьДокументыЗаДоговором(ЭтаФорма.Договор);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Элементы.Контрагент.Заголовок = "Конртагент: "+Параметры.Договор.Владелец;
	ЭтаФорма.Договор = Параметры.Договор;
	//Запрос = Новый Запрос(" 
	//		|ВЫБРАТЬ 
	//		|	Ссылка, 
	//		|	Наименование 
	//		|ИЗ 
	//		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//		|ГДЕ
	//		|	Не ПометкаУдаления		
	//		|	И (
	//		|		ДоговорыКонтрагентов.Номер ПОДОБНО  &НомерЗаявки
	//		|	)
	//		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора 
	//		|"); 
	//Запрос.УстановитьПараметр("НомерЗаявки", "%"+СокрЛП(НомерЗаявки)+"%");	
	//Запрос.УстановитьПараметр("ВидДоговора", ВидДогговораКлиент);		
	//Запрос.УстановитьПараметр("НомерБрони", "%"+СокрЛП(НомерБрони)+"%");		
	////Запрос.УстановитьПараметр("Контрагент", Контрагент);		
	//
	//
	//Результат = Запрос.Выполнить().Выбрать(); 
	//Пока Результат.Следующий() Цикл 		
	//	Возврат Результат.Ссылка;
	//	Прервать;
	//КонецЦикла;  
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДокументыЗаДоговором(Договор)
	Оплаты.Загрузить(ЭТ_ОбщийМодуль2.ПолучитьПлатежныеДокументыПоЗаявке(Договор,Договор.ВидДоговора).Выгрузить());
	Возврат Оплаты.Итог("СуммаДокумента");	
КонецФункции

&НаСервере
Процедура ОплатыВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеСтроки = Элементы.Оплаты.ДанныеСтроки(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(ДанныеСтроки.ДокументСсылка) Тогда
		ОткрытьЗначение(ДанныеСтроки.ДокументСсылка);
    КонецЕсли;
КонецПроцедуры
