&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ключ") Тогда
		Если ТипЗнч(Параметры.Ключ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") тогда
			ЭТ_ОбщийМодуль2.СохранитьНастройку("ДоговорыКонтрагентов_ПарамертыДоговора",Новый Структура("ДатаНачала,КомиссияТО,ЭТ_ПризнакАгента,Заголовок,ЭлементТекущий",Параметры.Ключ.ДатаНачала,Параметры.Ключ.КомиссияТО,Параметры.Ключ.ЭТ_ПризнакАгента,Параметры.Ключ.Наименование+" "+Параметры.Ключ.Владелец.Наименование,Параметры.Ключ));
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СохранениеДанныхНаСерсере(Данные)
	ТекущийОбъект = Данные.ЭлементТекущий.ПолучитьОбъект();
	Если ТекущийОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ТекущийОбъект.ДатаНачала = Данные.ДатаНачала;
	ТекущийОбъект.КомиссияТО = Данные.КомиссияТО;
	ТекущийОбъект.ЭТ_ПризнакАгента = Данные.ЭТ_ПризнакАгента;
	ТекущийОбъект.Записать();
	Возврат Истина;	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДанных()
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку("ДоговорыКонтрагентов_ПарамертыДоговора",Неопределено);
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Данные = ПолучитьСтруктуруДанных();
	ЭтаФорма.ДатаНачала = Данные.ДатаНачала;
	ЭтаФорма.КомиссияТО = Данные.КомиссияТО;
	ЭтаФорма.ЭТ_ПризнакАгента = Данные.ЭТ_ПризнакАгента;	
	ЭтаФорма.ЭлементТекущий = Данные.ЭлементТекущий;
	ЭтаФорма.Заголовок = "Параметры договора "+Данные.Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСохранения(Отказ)
	Структура = Новый Структура("ДатаНачала,КомиссияТО,ЭТ_ПризнакАгента,ЭлементТекущий",ЭтаФорма.ДатаНачала,ЭтаФорма.КомиссияТО, ЭтаФорма.ЭТ_ПризнакАгента, ЭтаФорма.ЭлементТекущий);
	Отказ = НЕ СохранениеДанныхНаСерсере(Структура);
КонецПроцедуры

&НаСервере
Процедура ОчисткаПередЗакрытием()
	ЭТ_ОбщийМодуль2.УдалитьНастройку("ДоговорыКонтрагентов_ПарамертыДоговора");	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаСохраненияИЗакрытия(Отказ)
	ОбработкаСохранения(Отказ);
	ОчисткаПередЗакрытием();
	Если НЕ Отказ Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ПриЗакрытииНаСервере()
	ЭТ_ОбщийМодуль2.УдалитьНастройку("ДоговорыКонтрагентов_ПарамертыДоговора");
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

