//ДоговорПриИзмененииНаСервере()
//при выборе договора заполняем поля формы (сервер)
&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Договор = Объект.Договор;
	Объект.Организация = Договор.Организация;
	Объект.ВладелецЭлемента = Договор.Владелец;
	Объект.ВалютаВзаиморасчетов = Договор.ВалютаВзаиморасчетов;
	Объект.КомиссияТО = ЭТ_ОбщийМодуль2.ПолучитьСуммуКомиссииТО(Договор);
КонецПроцедуры

//ДоговорПриИзменении(Элемент)
//при выборе договора заполняем поля формы (клиент)
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

Функция ПолучитьВсеДокументыПоДоговору(ДоговорСсылка)
	КВозврату = Новый ТаблицаЗначений;
	КВозврату.Колонки.Добавить("Документ");
	КВозврату.Колонки.Добавить("Дата");
	КВозврату.Колонки.Добавить("Проведен");
	КВозврату.Колонки.Добавить("ПомОткрытия");
	КВозврату.Колонки.Добавить("ПомЗакрытия");
	КВозврату.Колонки.Добавить("Проходов");
	КВозврату.Колонки.Добавить("ПорядокПрохода");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыПоДоговоруКонтрагента.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.ДокументыПоДоговоруКонтрагента(&ДоговорСсылка) КАК ДокументыПоДоговоруКонтрагента";
	Запрос.УстановитьПараметр("ДоговорСсылка",ДоговорСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СлСтрока = КВозврату.Добавить();
		СлСтрока.Документ = ВыборкаДетальныеЗаписи.Ссылка;
		СлСтрока.Дата = ВыборкаДетальныеЗаписи.Ссылка.Дата;
		СлСтрока.Проведен = ВыборкаДетальныеЗаписи.Ссылка.Проведен;
		СлСтрока.ПомОткрытия = Ложь;
		СлСтрока.ПомЗакрытия = Ложь;
		СлСтрока.Проходов = 0;
		СлСтрока.ПорядокПрохода = 0;		
	КонецЦикла;
	Возврат КВозврату;
КонецФункции

Функция ОперацияПроведения(Документссылка,Состояние)
	КВозврату = Истина;
	ДокументОбъект = Документссылка.ПолучитьОбъект();
	Попытка
		Если Не ДокументОбъект.Проведен И Состояние = Истина Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ИначеЕсли ДокументОбъект.Проведен И Состояние = Ложь Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	Исключение
		КВозврату = Ложь;
	КонецПопытки;
	Возврат КВозврату;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.ДатаДоговораНач = НачалоГода(ТекущаяДата());
	ЭтотОбъект.ДатаДоговораКон = ТекущаяДата(); 
	ЭтотОбъект.ВидДоговора = ПолучитьВидДоговораПоУмолчанию();
КонецПроцедуры


&НаСервере
Функция ПолучитьВидДоговораПоУмолчанию()
	Возврат Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
КонецФункции

&НаСервере
Процедура ПроставитьРублиНаСервере(ДатаДоговораНач,ДатаДоговораКон, ВидДоговора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Дата >= &ДатаДоговораНач
		|	И ДоговорыКонтрагентов.Дата <= &ДатаДоговораКон           
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора           
		|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВыбВалюта";
	
	Запрос.УстановитьПараметр("ВыбВалюта",Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаДоговораНач",ДатаДоговораНач);
	Запрос.УстановитьПараметр("ДатаДоговораКон",ДатаДоговораКон);
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СпДоговор.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СпДоговор.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;          
	Сообщить("Найдено элементов: "+Формат(СпДоговор.Количество(),"ЧДЦ=0; ЧРД=; ЧРГ=; ЧН=Ноль; ЧГ="));
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура НайтиДоговоры(Команда)
	ПроставитьРублиНаСервере(ЭтотОбъект.ДатаДоговораНач,ЭтотОбъект.ДатаДоговораКон,ЭтотОбъект.ВидДоговора);
КонецПроцедуры


&НаСервере
Функция ПолучитьВалютуРубли()
	Возврат Справочники.Валюты.НайтиПоКоду("643");
КонецФункции




&НаСервере
Процедура НайтиОператораНаСервере()
	ИННОператора = ЭТ_ОбщийМодуль2.ПолучитьИННтуроператора(ПоискНомерЗаявки);
КонецПроцедуры


&НаКлиенте
Процедура НайтиОператора(Команда)
	НайтиОператораНаСервере();
КонецПроцедуры

