Функция ПолучитьКомиссиюТОПоДоговору(Договор) Экспорт
	КВозврату = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭТ_КомиссияТО.ДоговорТО КАК ДоговорТО,
		|	ЭТ_КомиссияТО.СуммаКомиссии КАК СуммаКомиссии
		|ИЗ
		|	РегистрСведений.ЭТ_КомиссияТО КАК ЭТ_КомиссияТО
		|ГДЕ
		|	ЭТ_КомиссияТО.ДоговорТО = &ДоговорТО";
	
	Запрос.УстановитьПараметр("ДоговорТО", Договор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КВозврату = ВыборкаДетальныеЗаписи.СуммаКомиссии;
	КонецЦикла;
	Возврат  КВозврату;     
КонецФункции

Функция ПолучитьСуммуКомиссииТО(Договор,Сумма,КомиссияВходитВСумму=Ложь) Экспорт
	КВозврату = Новый Структура("Договор,СуммаНоменклатуры,СуммаКомиссии,Сообщение,Ошибки");
	КВозврату.Договор = Договор;
	КВозврату.Ошибки = Истина;
	КВозврату.Сообщение = "Данные комиссии ТО не определены.";
	КВозврату.СуммаНоменклатуры = Сумма;
	КВозврату.СуммаКомиссии = 0;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭТ_КомиссияТО.ДоговорТО КАК ДоговорТО,
		|	ЭТ_КомиссияТО.СуммаКомиссии КАК СуммаКомиссии
		|ИЗ
		|	РегистрСведений.ЭТ_КомиссияТО КАК ЭТ_КомиссияТО
		|ГДЕ
		|	ЭТ_КомиссияТО.ДоговорТО = &ДоговорТО";
	
	Запрос.УстановитьПараметр("ДоговорТО", Договор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КВозврату.СуммаКомиссии = ВыборкаДетальныеЗаписи.СуммаКомиссии;		
		Если КомиссияВходитВСумму Тогда
			КВозврату.СуммаНоменклатуры = Сумма-КВозврату.СуммаКомиссии;
		Иначе
			КВозврату.СуммаНоменклатуры = Сумма;
		КонецЕсли;
		КВозврату.Ошибки = Ложь;
		КВозврату.Сообщение = "Данные комиссии по договору "+Договор.Наименование+" определены в платежном поручении.";
		Возврат  КВозврату;
	КонецЦикла;

	ЗначениеПоУмолчанию = РегистрыСведений.ЭТ_КомиссияТО_ПоУмолчанию.ПолучитьКомиссиюТОПоУмолчанию(Договор.Организация, Договор.Владелец);
	Если ЗначениеПоУмолчанию.Ошибки = Истина Тогда
		КВозврату.Сообщение = КВозврату.Сообщение + " " + ЗначениеПоУмолчанию.Сообщение;
		Возврат  КВозврату;     
	Иначе                                                
		Если ЗначениеПоУмолчанию.МетодРасчета = Перечисления.ЭТ_КомиссияТО_МетодРасчета.Фиксированная Тогда
			КВозврату.СуммаКомиссии = ЗначениеПоУмолчанию.Фиксированная;						
		ИначеЕсли ЗначениеПоУмолчанию.МетодРасчета = Перечисления.ЭТ_КомиссияТО_МетодРасчета.Процент Тогда
			КВозврату.СуммаКомиссии = Сумма * ЗначениеПоУмолчанию.Процент / 100;						
		ИначеЕсли ЗначениеПоУмолчанию.МетодРасчета = Перечисления.ЭТ_КомиссияТО_МетодРасчета.ДоговорРеализации Тогда
			КВозврату.СуммаКомиссии = 0;									
		КонецЕсли;		               
		
		Если КомиссияВходитВСумму Тогда
			КВозврату.СуммаНоменклатуры = Сумма-КВозврату.СуммаКомиссии;
		Иначе
			КВозврату.СуммаНоменклатуры = Сумма;
		КонецЕсли;
	КонецЕсли;		
	КВозврату.Сообщение = "Данные комиссии партнера "+Договор.Владелец.Наименование+" ("+Договор.Владелец.ИНН+")"+" определены в карточке партнера.";
	КВозврату.Ошибки = Ложь;		
	
	Возврат  КВозврату;     
КонецФункции
