// ===== Низкоуровневые функции API интерфейса

// ПолучитьСоединениеСБ() Экспорт
//осуществляет соединение с СБ
&НаСервере
Функция ПолучитьСоединениеСБ() Экспорт
	//ЭТ_ОбщийМодуль2.Пауза(1);
	Возврат Новый HTTPСоединение(
	    "api.u-on.ru", // сервер (хост)
	    443, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    10, // таймаут в секундах, 0 или пусто - не устанавливать
	    Новый ЗащищенноеСоединениеOpenSSL()  // защищенное соединение, если используется https
	);
КонецФункции

//ОпроавитьПостЗапрос(Адрес,СтруктураПараметров,НомерПопытки=0) Экспорт
//отправляет POST запрос на указанный Адрес, количество попыток задается в настройках
&НаСервере
Функция ОпроавитьПостЗапрос(Адрес,СтруктураПараметров,НомерПопытки=0) Экспорт
	АПИ = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ApiKey");	
	Соединение = ПолучитьСоединениеСБ(); // Подключаемся к сайту.
	Запрос = Новый HTTPЗапрос(Строка(АПИ)+Строка(Адрес)+".json");
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);
	СтрJSON = ЗаписьJSON.Закрыть();
	Запрос.Заголовки.Вставить("Content-type", "application/json");
	Запрос.УстановитьТелоИзСтроки(СтрJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);	
	Код = 0;
	Результат = Соединение.ОтправитьДляОбработки(Запрос);
	Если Результат.КодСостояния>100 и Результат.КодСостояния<300 Тогда
		ЧтениеДСОН = Новый ЧтениеJSON;
		ЧтениеДСОН.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
		МассивДанных = ПрочитатьJSON(ЧтениеДСОН);
		Если МассивДанных.Свойство("id") Тогда
			Код = Число(МассивДанных.id);
		Иначе
			Код = МассивДанных;
		КонецЕсли;
		ЧтениеДСОН.Закрыть();
	ИначеЕсли Результат.КодСостояния=404 Тогда
		ЭТ_Почта.УведомлениеАдминистратору("Зафиксирована 404 ошибка (POST):"+Адрес," - 404 ошибка");
		Код = 0;			
	ИначеЕсли Результат.КодСостояния=429 Тогда
		НомерПопытки = НомерПопытки + 1;
		Сообщить("Превышен лимит времени, повторная попытка обращения.");
		ЭТ_Почта.УведомлениеАдминистратору(Адрес+" "+СтрJSON,"Превышен лимит времени, повторная попытка обращения. ["+Формат(НомерПопытки,"ЧДЦ=; ЧРГ=; ЧГ=0; ЧО=1")+"]");		
		Возврат ОпроавитьПостЗапрос(Адрес,СтруктураПараметров);		
	Иначе
		НомерПопытки = НомерПопытки + 1;
		ПовторнаяПопытка = Ложь;
		Сообщение = "ОШИБКА [ОпроавитьПостЗапрос]: "+Адрес+" "+СтрJSON+" "+Формат(Результат.КодСостояния,"ЧДЦ=; ЧРГ=; ЧГ=0; ЧО=1")+". Во время получения данных возникла ошибка. Проверьте исходные параметры.";
		Если НомерПопытки<ЭТ_ОбщийМодуль2.ПолучитьНастройку("КолВоПопытокЮОН",0) Тогда
			ПовторнаяПопытка = Истина;
			Сообщение = Сообщение + " Повторная попытка обращения. ["+Формат(НомерПопытки,"ЧДЦ=; ЧРГ=; ЧГ=0; ЧО=1")+"]";
		КонецЕсли;
		Сообщить(Сообщение,СтатусСообщения.Внимание);
		ЭТ_Почта.УведомлениеАдминистратору(Сообщение,"ОШИБКА [ОпроавитьПостЗапрос]: "+Адрес+" "+Формат(Результат.КодСостояния,"ЧДЦ=; ЧРГ=; ЧГ=0; ЧО=1"));
		Если ПовторнаяПопытка = Истина Тогда
			Возврат ОпроавитьПостЗапрос(Адрес,СтруктураПараметров,НомерПопытки);
		КонецЕсли;		
	КонецЕсли;
	Возврат Код;
КонецФункции

//ОпроавитьГетЗапрос(Адрес,ПеременнаяРезультата="",НомерПопытки=0) Экспорт
//отправляет GET запрос на указанный Адрес, количество попыток задается в настройках
&НаСервере
Функция ОпроавитьГетЗапрос(Адрес,ПеременнаяРезультата="",НомерПопытки=0) Экспорт
	КВозврату = Ложь;
    Соединение = ПолучитьСоединениеСБ();
	АПИ = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ApiKey");     
	Если СтрДлина(АПИ)<1 Тогда
		Возврат Ложь;
	КонецЕсли;
    Запрос = Новый HTTPЗапрос(Строка(АПИ)+Строка(Адрес)+".json");
	Результат = Соединение.Получить(Запрос);	
	ЗафиксированПроход = Ложь;
	РезультатКодСтрокиСостояния = Результат.КодСостояния;
	Если Результат.КодСостояния>100 и Результат.КодСостояния<300 Тогда
		ЗафиксированПроход = Истина;		
		ЧтениеДСОН = Новый ЧтениеJSON; 
		Дат = Результат.ПолучитьТелоКакСтроку();
		Если СтрНайти(Адрес,"/supplier/")<>0 Тогда
			Дат = СтрЗаменить(Дат,"{"+Символ(34)+"record"+Символ(34)+":{"+Символ(34)+"0"+Символ(34)+":","");
			Дат = СтрЗаменить(Дат,","+Символ(34)+"extended_fields"+Символ(34)+":[]},"+Символ(34)+"result"+Символ(34)+":200}","");
		КонецЕсли;
		ЧтениеДСОН.УстановитьСтроку(Дат); 		
		МассивДанных = ПрочитатьJSON(ЧтениеДСОН);
		ЧтениеДСОН.Закрыть();
		Если СтрДлина(СокрЛП(ПеременнаяРезультата))<1 Тогда
			КВозврату = МассивДанных;	
		ИначеЕсли МассивДанных.Свойство(ПеременнаяРезультата) Тогда
			Если МассивДанных[ПеременнаяРезультата].Количество()>0 Тогда
				КВозврату=МассивДанных[ПеременнаяРезультата];
			КонецЕсли;
		Иначе
			КВозврату = Ложь;			
		КонецЕсли;		
	ИначеЕсли Результат.КодСостояния=404 Тогда
		ЭТ_Почта.УведомлениеАдминистратору("Зафиксирована 404 ошибка (GET):"+Адрес," - 404 ошибка");
		КВозврату = Ложь;			
	ИначеЕсли Результат.КодСостояния=429 Тогда
		НомерПопытки = НомерПопытки + 1;
		Сообщить("Превышен лимит времени, повторная попытка обращения.");
		ЭТ_Почта.УведомлениеАдминистратору(Адрес+" "+ПеременнаяРезультата,"Превышен лимит времени, повторная попытка обращения. ["+Формат(НомерПопытки,"ЧДЦ=; ЧРГ=; ЧГ=0; ЧО=1")+"]");
		Возврат ОпроавитьГетЗапрос(Адрес,ПеременнаяРезультата="",НомерПопытки);
	Иначе
		НомерПопытки = НомерПопытки + 1;
		ПовторнаяПопытка = Ложь;
		Сообщение = "ОШИБКА [ОпроавитьГетЗапрос]: "+Адрес+" "+Формат(Результат.КодСостояния,"ЧДЦ=; ЧРГ=; ЧГ=0; ЧО=1")+". Во время получения данных возникла ошибка. Проверьте исходные параметры.";
		Если НомерПопытки<ЭТ_ОбщийМодуль2.ПолучитьНастройку("КолВоПопытокЮОН") Тогда
			ПовторнаяПопытка = Истина;
			Сообщение = Сообщение + " Повторная попытка обращения. ["+Формат(НомерПопытки,"ЧДЦ=; ЧРГ=; ЧГ=0; ЧО=1")+"]";
		КонецЕсли;
		Сообщить(Сообщение,СтатусСообщения.Внимание);
		ЭТ_Почта.УведомлениеАдминистратору(Сообщение,"ОШИБКА [ОпроавитьГетЗапрос]: "+Формат(Результат.КодСостояния,"ЧДЦ=; ЧРГ=; ЧГ=0; ЧО=1"));
		Если ПовторнаяПопытка = Истина Тогда
			Возврат ОпроавитьГетЗапрос(Адрес,ПеременнаяРезультата,НомерПопытки);
		Иначе
			КВозврату = Ложь;
		КонецЕсли;		
	КонецЕсли;
	Возврат КВозврату;	
КонецФункции
