&НаСервере
Процедура ОтправитьПисьмо(Адресат,Тема,Содержание, СкрытьУведомление=Ложь) Экспорт
	ОшибкаОтправкиПочты = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ОшибкаОтправкиПочты",Ложь);	    
	Если ОшибкаОтправкиПочты <> Ложь Тогда
		Если ТекущаяДата()<ОшибкаОтправкиПочты+60 Тогда
			Сообщить ("Письмо не отправлено. Адресат:"+Адресат+";  Тема: "+Тема + "; Ошибка: " + ОшибкаОтправкиПочты);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ПараметрыПочты = Новый ИнтернетПочтовыйПрофиль;
    ПараметрыПочты.АдресСервераSMTP = "smtp.yandex.ru";

	//ПараметрыПочты.АдресСервераSMTP = "mail1.elitatravel.ru";
	ПараметрыПочты.ИспользоватьSSLSMTP = Истина;
	//ПараметрыПочты.АутентификацияSMTP = СпособSMTPАутентификации.CramMD5;
	ПараметрыПочты.ПользовательSMTP = "e20elita@yandex.ru";
	ПараметрыПочты.ПарольSMTP="yftrizfnxuonjatd";	
	ПараметрыПочты.ПортSMTP=465;
	//ПараметрыПочты.ПортSMTP=25;
	Письмо=новый ИнтернетПочтовоеСообщение;
	Письмо.Тема=Тема;
	Письмо.ИмяОтправителя="1С-ЭТ";
	Письмо.Отправитель="e20elita@yandex.ru";
	Письмо.Тексты.Добавить(Содержание);
	Для Каждого СледАдрес Из ЭТ_ОбщийМодуль2.СоздатьСписокКлючей(Адресат) Цикл
		Письмо.Получатели.Добавить(СледАдрес);
		//Письмо.Вложения.Добавить("адрес файла вложения на жестком диске");
		Подключение=новый ИнтернетПочта;
		Попытка
			Подключение.Подключиться(ПараметрыПочты);
			Подключение.Послать(Письмо);
			Если НЕ СкрытьУведомление Тогда Сообщить ("Письмо успешно отправлено. Адресат:"+Адресат+";  Тема: "+Тема); КонецЕсли;
		Исключение
			ЭТ_ОбщийМодуль2.СохранитьНастройку("ОшибкаОтправкиПочты",ТекущаяДата());
			Сообщить ("Письмо не отправлено. Адресат:"+Адресат+";  Тема: "+Тема + "; Ошибка: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура УведомлениеАдминистратору(Сообщение,Тема = "") Экспорт
	
	ТекстСообщения = "Данное сообщение отправлено автоматический из системы 1С
	|" + Сообщение + "
	| КОНЕЦ СООБЩЕНИЯ ==================================
	|
	| Метка времени: " + Формат(ТекущаяДата(),"ДЛФ=DT") + "
	| Пользователь сеанса: " + ИмяПользователя() + "
	| Отправлено через: модуль расширения конфигурации 1С ЭТ, ОбщийМодуль.ЭТ_Почта
	|";
	ОтправитьПисьмо(ЭТ_ОбщийМодуль2.СписокАдресовАдмина(), "Автоматическое уведомление 1С "+Тема,ТекстСообщения,Истина);
КонецПроцедуры

Процедура УведомлениеБухгалтерии(Сообщение,Тема = "") Экспорт
		ТекстСообщения = "Данное сообщение отправлено автоматический из системы 1С
	|" + Сообщение + "
	| КОНЕЦ СООБЩЕНИЯ ==================================
	|
	| Метка времени: " + Формат(ТекущаяДата(),"ДЛФ=DT") + "
	| Пользователь сеанса: " + ИмяПользователя() + "
	| Отправлено через: модуль расширения конфигурации 1С ЭТ, ОбщийМодуль.ЭТ_Почта
	|";
	ОтправитьПисьмо(ЭТ_ОбщийМодуль2.СписокАдресовБухгалтерии(), "Автоматическое уведомление 1С "+Тема,ТекстСообщения,Истина);
КонецПроцедуры