//СохранитьНастройку(КлючНастроек,Настройки)
//сохраняет конкретную настройку клиента
&НаСервере
Процедура СохранитьНастройку(КлючНастроек,Настройки)
	КлючОбъекта  = "ЭТ";
    ИмяПользователя = ИмяПользователя();
    ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);
КонецПроцедуры

//ПолучитьНастройку(КлючНастроек)
//получает настройку клиента по ее ключу
&НаСервере
Функция ПолучитьНастройку(КлючНастроек)
	КлючОбъекта  = "ЭТ";
    ИмяПользователя = ИмяПользователя();
	Настройки = Неопределено;
    Попытка
        Настройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек,,ИмяПользователя);
    Исключение
        Настройки = Неопределено;
    КонецПопытки;

	Возврат Настройки;
КонецФункции

//КлючАПИПриИзмененииНаСервере()
//на сервере изменяет ключ АПИ
&НаСервере
Процедура КлючАПИПриИзмененииНаСервере()
	СохранитьНастройку("ApiKey",Объект.ApiKey);	
	СохранитьНастройку("ВыключитьМодуль",Объект.ВыключитьМодуль);	
КонецПроцедуры

//КлючАПИПриИзмененииНаСервере()
//на клиенте изменяет ключ АПИ
&НаКлиенте
Процедура КлючАПИПриИзменении(Элемент)
	КлючАПИПриИзмененииНаСервере();
КонецПроцедуры

//ПриОткрытииНаСервере()
//при открытии на сервере получает настройку
&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.ApiKey=ПолучитьНастройку("ApiKey");
	Объект.ВыключитьМодуль=ПолучитьНастройку("ВыключитьМодуль");
КонецПроцедуры

//ПриОткрытии(Отказ)
//при открытии на клиенте получает настройку (см.сервер)
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если СтрНайти(нрег(ПользователиКлиентСервер.ТекущийПользователь()),нрег("уралфинанс"))>0 Тогда      
		Отказ = Истина;
		Предупреждение("Вам запрещено менять настройки");
		Возврат;
	КонецЕсли;	
	ПриОткрытииНаСервере();
КонецПроцедуры

//КультурныйВыходНаСервере()
//при закрытии окна, нужно сохранить настройку (сервер)
&НаСервере
Процедура КультурныйВыходНаСервере()
	СохранитьНастройку("ApiKey",Объект.ApiKey);	
КонецПроцедуры

//КультурныйВыход(Команда)
//при закрытии окна, нужно сохранить настройку (клиент)
&НаКлиенте
Процедура КультурныйВыход(Команда)
	КультурныйВыходНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры
