
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)      
	Организация = ПолучитьОрганизациюТекущегоПользователя();
	ЗначенияЗаполнения = Новый Структура("Организация,Контрагент", Организация,ПараметрКоманды);
	ОткрытьФорму("ОбщаяФорма.ЭТ_КомиссияТО", ЗначенияЗаполнения, ПараметрыВыполненияКоманды.Источник, Истина, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

        


&НаСервере
Функция ПолучитьОрганизациюТекущегоПользователя()
	Возврат Пользователи.ТекущийПользователь().Подразделение.Владелец;	
КонецФункции

	