
&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = Каталог;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выбирите каталог";
	Если Диалог.Выбрать() Тогда
		Каталог = Диалог.Каталог;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Каталог = "K:\SBER\OOOET\Реестр_платежей";
КонецПроцедуры                                

&НаКлиенте
Процедура КомандаЗагрузить(Команда)       
	Объект.ЗаписиЗагрузки.Очистить();
	МассивНайденных = НайтиФайлы(Каталог, "*.txt");
	Для Каждого СледФайл ИЗ МассивНайденных Цикл  
		ПрочитатьФайл(СледФайл.ПолноеИмя);
	КонецЦикла;
КонецПроцедуры


&НаСервере
Функция СтрМас(Стр)          
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,";");
КонецФункции

&НаКлиенте
Процедура ОчиститьКаталог(Команда)     
 	ТекстВопроса = "Вы действительно желаете удалить файлы из каталога "+Каталог+" ?";
	Оповещение = Новый ОписаниеОповещения("ОчисткаКаталога",ЭтотОбъект, );
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры


&НаКлиенте
Процедура ОчисткаКаталога(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
		  УдалитьФайлы(Каталог, "*.txt"); 
		  ПоказатьПредупреждение(,"Каталог очищен!",,"Успех операции");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(ИмяФайла)
	КодировкаФайла = КодировкаТекста.Системная;

	ФайлДанных = Новый ТекстовыйДокумент;
	ФайлДанных.Прочитать(ИмяФайла, КодировкаФайла); //получаем содержимое файла построчно
	КоличествоСтрок = ФайлДанных.КоличествоСтрок();

	Для СчСтрок = 1 По КоличествоСтрок Цикл
		СтрокаДанных = ФайлДанных.ПолучитьСтроку(СчСтрок);  
		
		//СтрокаДанныхМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДанных, ",");
		СтрокаДанныхМассив = СтрМас(СтрокаДанных);
		
		Если (СтрокаДанныхМассив.Количество()>3) И (Объект.ЗаписиЗагрузки.НайтиСтроки(Новый Структура("СтрокаДанных",СтрокаДанных)).Количество()<1 ИЛИ УбратьДубли = Ложь) Тогда
			НовСтр = Объект.ЗаписиЗагрузки.Добавить();
			НовСтр.Файл = ИмяФайла;
			НовСтр.СтрокаДанных = СтрокаДанных;
			Для СчМассив = 0 По СтрокаДанныхМассив.Количество() Цикл
				Если СчМассив<СтрокаДанныхМассив.Количество() И  СчМассив < 10 Тогда
					НовСтр["п"+Формат(СчМассив+1,"ЧДЦ=0; ЧРД=; ЧРГ=; ЧН=0; ЧГ=")] = СтрокаДанныхМассив[СчМассив];   
				КонецЕсли;
			КонецЦикла;    
		КонецЕсли;
	КонецЦикла;			

КонецПроцедуры


////Открываем стандартный диалог Windows выбора каталога/файла в режиме выбора файла на сохранение - ДиалогВыбораФайла 1С
//	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
//	//каталог по-умолчанию, можно не указывать
//	Диалог.Каталог = "K:\SBER\OOOET\Реестр_платежей";
//	Диалог.МножественныйВыбор = Ложь;
//	Диалог.Заголовок = "Выбирите каталог";
//	Если Диалог.Выбрать() Тогда
//		МассивНайденных = НайтиФайлы(Диалог.Каталог, "*.txt");
//		Для Каждого СледФайл ИЗ МассивНайденных Цикл
//			Сообщить(СледФайл);
//		КонецЦикла;
//	КонецЕсли;