&НаСервере
Процедура СохранитьНастройку(КлючНастройки,Значение)
	ЭТ_ОбщийМодуль2.СохранитьНастройку(КлючНастройки,Значение);	
КонецПроцедуры

&НаКлиенте
&Перед("ОбработкаКоманды")
Процедура ЭТ_ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//КлючОперации = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ТекущийКлючЧека","");
	Если ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.Объект.ДоговорКонтрагента) = Истина Тогда
		//ДоговорКонтрагента = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(ПараметрыВыполненияКоманды.Источник.Объект.ДоговорКонтрагента.ПолучитьОбъект(),ПолучитьНастройку("Префикс"));
		ОбновитьЭлПочтуКонтрагента(ВернутьНомерДоговора(ПараметрыВыполненияКоманды.Источник.Объект.ДоговорКонтрагента));
	КонецЕсли;
	//СохранитьНастройку("ТекущийКлючЧека","");
	
КонецПроцедуры

&НаСервере
Функция ВернутьНомерДоговора(НомерДоговора)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(НомерДоговора,ПолучитьНастройку("Префикс"));
КонецФункции



&НаСервере
Процедура ОбновитьЭлПочтуКонтрагента(НомерДоговора)
	ТекущийПрефикс = ПолучитьНастройку("Префикс");
	МассивНомеров = Новый Массив;
	Для Каждого ВариантНомера Из ПолучитьВариантыНомера(НомерДоговора) Цикл
		Парам = Новый Структура;
		Парам.Вставить("r_id_internal",ВариантНомера);	
		МассивДанных = ПолучитьМассивЗаявок(Парам);
		Если МассивДанных.Количество()>0 Тогда		
			Для Каждого СледЭлемент Из МассивДанных Цикл
				МассивНомеров.Добавить(СледЭлемент.id);
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	Для Каждого СледЗаявкаНомер Из ЭТ_ОбщийМодуль2.УдалитьДублиИзМассива(МассивНомеров) Цикл
		ДанныеЗаявки = 	ПолучитьДанныеЗаявки(СледЗаявкаНомер);
		Если ДанныеЗаявки.Количество()>0 Тогда
			Для Каждого СледЗаявка Из ДанныеЗаявки Цикл
				//Проверяем наличие договора
				Если СледЗаявка.Свойство("id_internal") Тогда
					НайденДоговор = НайтиДоговорПокупателя(СледЗаявка.id_internal,Ложь);
					ЭлПочтаДеф = ?(СледЗаявка.Свойство("client_email")=Истина,СледЗаявка.client_email,"");
					Если НЕ НайденДоговор = Ложь Тогда
						Контрагент = ПолучитьКонтрагентаПоДоговору(НайденДоговор,ЭлПочтаДеф);
						РасшифровкаПлатежаДоговорКонтрагента=НайденДоговор;
					Иначе
						СозданДоговор = СоздатьДоговорПокупателя(СледЗаявка);
						Контрагент = ПолучитьКонтрагентаПоДоговору(СозданДоговор,ЭлПочтаДеф);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

//ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
//получает настройку клиента по присланному ключу
&НаСервере
Функция ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку(Ключ,ПоУмолчанию);	
КонецФункции

// ПолучитьВариантыНомера(СтрокаПоиска)
//на основании присланной строки с номером документа возвращает варианты возможных номеров заявки
&НаСервере
Функция ПолучитьВариантыНомера(СтрокаПоиска)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьВариантыНомера(СтрокаПоиска);
КонецФункции

//ПолучитьДанныеЗаявки(СледЗаявкаНомер)
//по присланному коду заявки получает структуру данных заявки из СБ
&НаСервере
Функция ПолучитьДанныеЗаявки(СледЗаявкаНомер)
	Возврат ЭТ_ОбщийМодуль2.Request(Новый Структура("id",СледЗаявкаНомер));
КонецФункции

//ПолучитьМассивЗаявок(Параметры)
//согласно присланной структуре параметров, получает перечень подходящих заявок из СБ
&НаСервере
Функция ПолучитьМассивЗаявок(Параметры)
	Возврат ЭТ_ОбщийМодуль2.RequestSearch(Параметры);	
КонецФункции

//НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
//выполняет поиск договора покупателя, на основании присланного номера заявки
//новый договор не создает
//возвращает ссылку на договор
&НаСервере
Функция НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
	ВидДоговораКлиент = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент");
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование 
		|ИЗ 
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Номер = &НомерДоговора
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора 
		|"); 
	Запрос.УстановитьПараметр("НомерДоговора", НомерЗаявки);	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговораКлиент);		
	Результат = Запрос.Выполнить().Выбрать(); 
	Пока Результат.Следующий() Цикл 		
		Возврат Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Возврат ПоУмолчанию;
КонецФункции

//ПолучитьКонтрагентаПоДоговору(Договор)
// возвращает контрагента по договору
&НаСервере
Функция ПолучитьКонтрагентаПоДоговору(Договор,Адрес="")
	Если СтрДлина(СокрЛП(Адрес))>0 Тогда 
		ЭТ_ОбщийМодуль2.КорректировкаЭлПочтыКонтрагента(Договор.Владелец,Адрес);
	КонецЕсли;
	Возврат Договор.Владелец;
КонецФункции

//СоздатьДоговорПокупателя(Заявка)
//на основании присланной структуры параметров заявки СБ, 
//осуществляет поиск договора в 1С, если договора нет, то создается новый договор
&НаСервере
Функция СоздатьДоговорПокупателя(Заявка)
	//Получаем заявку
	
	//Заявка = ЭТ_ОбщийМодуль2.Request(Новый Структура("id",КодЗаявки));
	Заказчик = ЭТ_ОбщийМодуль2.User(Новый Структура("id",Заявка.client_id));
	Контрагент = ВернутьКонтрагентаПоЗаявке(Заявка);
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование
		|ИЗ 
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И (
		|		ДоговорыКонтрагентов.Номер = &НомерЗаявки
		|		ИЛИ ДоговорыКонтрагентов.Наименование ПОДОБНО &НомерЗаявкиЧасть
		|	)
		|"); 
	Запрос.УстановитьПараметр("Контрагент", Контрагент.Ссылка);	
	Запрос.УстановитьПараметр("НомерЗаявки", СокрЛП(Заявка.id_internal));
	Запрос.УстановитьПараметр("НомерЗаявкиЧасть", "%"+СокрЛП(Заявка.id_internal)+"%");
	Результат = Запрос.Выполнить().Выбрать();
	НайденДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Пока Результат.Следующий() Цикл 
		НайденДоговор = Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Если НайденДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		НайденДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();		
		НайденДоговор.Владелец = Контрагент.Ссылка;
		НайденДоговор.Номер = СокрЛП(Заявка.id_internal);
		ДатаЗ = Заявка.dat;
		НайденДоговор.Дата = ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВДату(ДатаЗ);
		ДатаЗ = Заявка.dat;
		НайденДоговор.Наименование = СокрЛП(Заявка.id_internal)+" от "+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(ДатаЗ);
		ВидДоговора = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент");
		НайденДоговор.Организация = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация");
		НайденДоговор.ВалютаВзаиморасчетов = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВалютаДокументов1С");
		НайденДоговор.ВидДоговора = ВидДоговора;
		НайденДоговор.Записать();
	КонецЕсли;
	Возврат НайденДоговор.Ссылка;
КонецФункции


//ВернутьКонтрагентаПоЗаявке(Заявка)
//возвращает Контрагента 1С по заявке, на основании присланной структуры параметров заявки СБ
&НаСервере
Функция ВернутьКонтрагентаПоЗаявке(Заявка)
	//Получаем заявку
	Заказчик = ЭТ_ОбщийМодуль2.User(Новый Структура("id",Заявка.client_id));
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование
		|ИЗ 
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(Контрагенты.ИНН = &ИНН И Контрагенты.ИНН<>"""")
		|	ИЛИ (ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ПаспортПолный И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>"""")
		|	ИЛИ ((Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортПолный ИЛИ Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортНомер) И (Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортДата) И Контрагенты.ДокументУдостоверяющийЛичность<>"""")
		|	ИЛИ (Контрагенты.НаименованиеПолное ПОДОБНО &Фамилия И Контрагенты.НаименованиеПолное ПОДОБНО &Имя И Контрагенты.НаименованиеПолное ПОДОБНО &Отчество И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ДатаРождения И Контрагенты.НаименованиеПолное<>"""" И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>"""")
		|"); 
	Запрос.УстановитьПараметр("ИНН", Заказчик.u_inn);	
	Запрос.УстановитьПараметр("ПаспортПолный", "%"+Заказчик.u_passport_number+"%");
	Запрос.УстановитьПараметр("ПаспортНомер", "%"+Прав(Заказчик.u_passport_number,6)+"%");
	Запрос.УстановитьПараметр("ПаспортДата", "%"+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_passport_date)+"%");
	Запрос.УстановитьПараметр("Фамилия", "%"+Заказчик.u_surname+"%");
	Запрос.УстановитьПараметр("Имя", "%"+Заказчик.u_name+"%");
	Запрос.УстановитьПараметр("Отчество", "%"+Заказчик.u_sname+"%");
	Запрос.УстановитьПараметр("ДатаРождения", ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday));
	Результат = Запрос.Выполнить().Выбрать();
	НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка();	
	Пока Результат.Следующий() Цикл 
		НайденКонтрагент = Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Если НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		НайденКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		//Физик или Юрик
		Если СтрДлина(СокрЛП(Заказчик.u_company))>0 Тогда
			//заполняем юрика
			НайденКонтрагент.Наименование = Заказчик.u_company;
			НайденКонтрагент.НаименованиеПолное = Заказчик.u_company;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			НайденКонтрагент.ИНН =  Заказчик.u_inn;			
		Иначе
			//заполняем физика
			НайденКонтрагент.Наименование = Заказчик.u_surname+" "+Заказчик.u_name+" "+Заказчик.u_sname;
			НайденКонтрагент.НаименованиеПолное = Заказчик.u_surname+" "+Заказчик.u_name+" "+Заказчик.u_sname;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			НайденКонтрагент.ИНН =  Заказчик.u_inn;
			Паспорт = "";
			Если СтрДлина(Заказчик.u_passport_number)>0 Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+Заказчик.u_passport_number;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_taken)>0 Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+"выдан "+Заказчик.u_passport_taken;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_date)>0 Тогда 				
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;
				Паспорт = Паспорт+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_passport_date);
			КонецЕсли;
			Если СтрДлина(Паспорт)>0 Тогда 
				НайденКонтрагент.ДокументУдостоверяющийЛичность = Паспорт;
			КонецЕсли;
			
			ДатаРождения = "";			
			Если СтрДлина(Заказчик.u_birthday)>0 Тогда 
				ДатаРождения = ДатаРождения+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday);
			КонецЕсли;
			
			НайденКонтрагент.Комментарий = "";
			Если СтрДлина(Паспорт)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+Паспорт; КонецЕсли;
			Если СтрДлина(ДатаРождения)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" д.р. "+ДатаРождения; КонецЕсли;
		КонецЕсли;
		НайденКонтрагент.ДополнительнаяИнформация = "";
		Если СтрДлина(Заказчик.address)>0 Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Адрес: "+Заказчик.address;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.Представление = СокрЛП(Заказчик.address);				
		КонецЕсли;
		
		Если СтрДлина(Заказчик.u_phone_mobile)>0 ИЛИ СтрДлина(Заказчик.u_phone)>0 Тогда
			Телефоны = Новый Массив(2);
			СчетМассив = 0;
			Если СтрДлина(Заказчик.u_phone_mobile)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone_mobile;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_phone)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone;
			КонецЕсли;				
			Если Телефоны.Количество()>0 Тогда
				Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
				НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Телефоны: "+СокрЛП(СтрСоединить(Телефоны,", "));					
				НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
				НоваяСтрока.Представление = СокрЛП(СтрСоединить(Телефоны,", "));
				НоваяСтрока.НомерТелефона = Телефоны[0];
			КонецЕсли;				
		КонецЕсли;
		Если СтрДлина(Заказчик.u_email)>0 Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Эл.почта: "+Заказчик.u_email;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.АдресЭП = Заказчик.u_email;
			НоваяСтрока.Представление = СокрЛП(Заказчик.u_email);			
		КонецЕсли;
		КаталогЗаказчиков = ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогЗаказчиков");
		НайденКонтрагент.Родитель = КаталогЗаказчиков;
		НайденКонтрагент.Записать();
	КонецЕсли;
	Возврат НайденКонтрагент;
КонецФункции
