
//ЭТ_ОбработкаПроведения(Отказ, РежимПроведения)
//при проведении документа отчет делаем в КнигаУчетаДоходовИРасходов выбираем записи по документу и заменяем в нем содержание
//шаблон можно посмотреть в коде
&После("ОбработкаПроведения")
Процедура ЭТ_ОбработкаПроведения(Отказ, РежимПроведения)  
	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);   
	НаборЗаписей.Прочитать();
	Для каждого СледЗапись Из ЭтотОбъект.Товары Цикл
		Если НЕ СледЗапись.ЭТ_ДоговорТО.Пустая() Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка;
			НоваяЗапись.Организация = ЭтотОбъект.Организация;
			НоваяЗапись.Период = ЭтотОбъект.Дата;
			НоваяЗапись.Содержание = "Агентское вознаграждение на договор";
			НоваяЗапись.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
			НоваяЗапись.СубконтоДт.Договоры = СледЗапись.ЭТ_ДоговорТО;
			//ПолучитьДоговорТО(ЭтотОбъект,СледЗапись);
			НоваяЗапись.СубконтоКт.Контрагенты = ЭтотОбъект.Контрагент;
			НоваяЗапись.СубконтоКт.Договоры = ЭтотОбъект.ДоговорКонтрагента;
			НоваяЗапись.СубконтоКт.ДокументыРасчетовСКонтрагентами = ЭтотОбъект;
			НоваяЗапись.Сумма = СледЗапись.СуммаВознаграждения;
			НоваяЗапись.СчетДт = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ОтчетКомитентаСчетУчетаРасчетовСКонтрагентом"); 
			НоваяЗапись.СчетКт = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ОтчетКомитентаСчетУчетаРасчетовСКонтрагентом"); 		
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры
	
 // Отмена проведения: удаляем движения, которые были добавлены при проведении
&После("ОбработкаУдаленияПроведения")
Процедура ЭТ_ОбработкаУдаленияПроведения(Отказ)

	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();

	// Ничего не добавляем, просто записываем набор по регистратору заново,
	// тем самым очищая движения, созданные этим документом
	НаборЗаписей.Записать();

КонецПроцедуры

//	Если ((ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация",Ложь) = Ложь) или (ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация",Ложь)<>ЭтотОбъект.Организация)) Тогда Возврат; КонецЕсли;

////Выберем всех регистраторов регистра
//    Запрос = Новый Запрос;
//    Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
//        | КнигаУчетаДоходовИРасходов.Регистратор,
//        | КнигаУчетаДоходовИРасходов.Содержание
//        |ИЗ
//        | РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов
//		|ГДЕ
//		|	КнигаУчетаДоходовИРасходов.Регистратор = &Регистратор
//		|";
//	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);	
//    Результат = Запрос.Выполнить();
//    Выборка = Результат.Выбрать();
//    //Обойдем регистраторов
//    Пока Выборка.Следующий() Цикл
//        //Для каждого регистратора выполним изменение набора записей
//		НаборЗаписей = РегистрыНакопления.КнигаУчетаДоходовИРасходов.СоздатьНаборЗаписей(); 
//		НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
//		НаборЗаписей.Прочитать();
//		Для каждого Запись Из НаборЗаписей Цикл
//		    Запись.Содержание = СтрЗаменить(Запись.Содержание," в торговле (комиссионное вознаграждение)","");
//		    Запись.Содержание = СтрЗаменить(Запись.Содержание,"Комиссионное вознаграждение удержано из выручки комитента.","");
//		    Запись.Содержание = СтрЗаменить(Запись.Содержание,ЭТ_ОбщийМодуль2.НайтиПоШаблону(Запись.Содержание,"от 11.11.1111","",1),"");
//		КонецЦикла;
//		НаборЗаписей.Записать();
//	КонецЦикла;
//	
//	
//	
//	
//	
//	
//	 	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
//		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
//		НаборЗаписей.Прочитать();
//		Для Каждого СледЗапись Из НаборЗаписей Цикл
//			СледЗапись.Сумма = СледЗапись.Сумма - ЭтотОбъект.ДоговорКонтрагента.КомиссияТО;
//		КонецЦикла;
//		
//		
//		НаборЗаписей.ОбменДанными.Загрузка = Истина;
//		//НаборЗаписей.РучнаяКорректировка   = Истина;
//		//НоваяЗапись = НаборЗаписей.Добавить();
//		
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст =  "ВЫБРАТЬ
//		|ОтчетКомитентуОПродажахТовары.СуммаВознаграждения КАК СуммаВознаграждения
//		|ИЗ
//		|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
//		|		ПО (ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажах.Ссылка)
//		|ГДЕ
//		|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка
//		|	И ОтчетКомитентуОПродажахТовары.Номенклатура <> &Номенклатура
//		|";
//		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
//		Запрос.УстановитьПараметр("Номенклатура", ЭТ_ОбщийМодуль2.ПолучитьНастройку("ОтчетКомитентаДополнительноеВознаграждение"));
//		Результат = Запрос.Выполнить();
//		Выборка = Результат.Выбрать();

//		Пока Выборка.Следующий() Цикл
//			НоваяЗапись = НаборЗаписей.Вставить(0);
//			НоваяЗапись.КоличествоКт = 1;		
//			НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка;
//			НоваяЗапись.Организация = ЭтотОбъект.Организация;
//			НоваяЗапись.Период = ЭтотОбъект.Дата;
//			НоваяЗапись.ПодразделениеКт =  ЭтотОбъект.Ссылка;		
//			НоваяЗапись.Содержание = "Оказание услуг по договору комиссии";
//			НоваяЗапись.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
//			НоваяЗапись.СубконтоДт.Договоры = ЭтотОбъект.ДоговорКонтрагента;
//			НоваяЗапись.СубконтоДт.ДокументыРасчетовСКонтрагентами = ЭтотОбъект.Ссылка;
//			НоваяЗапись.СубконтоКт.Номенклатура = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ОтчетКомитентаДополнительноеВознаграждение",Справочники.Номенклатура.ПустаяСсылка());
//			НоваяЗапись.СубконтоКт.НоменклатурныеГруппы = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ОтчетКомитентаДополнительноеВознаграждениеГруппа",Справочники.НоменклатурныеГруппы.ПустаяСсылка());
//			НоваяЗапись.СубконтоКт.СтавкиНДС = Перечисления["СтавкиНДС"]["БезНДС"];
//			Если Выборка.СуммаВознаграждения>0 Тогда
//				НоваяЗапись.Сумма = Выборка.СуммаВознаграждения;
//			Иначе
//				НоваяЗапись.Сумма = ЭтотОбъект.ДоговорКонтрагента.КомиссияТО;
//			КонецЕсли;
//			НоваяЗапись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09"); 
//			НоваяЗапись.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.01.1"); 		
//		КонецЦикла;		
//		НаборЗаписей.Записать();
//	
//	
//	
//		
//	////Найдем и перепроведем документ реализации, чтобы учесть изменения сделанные в отчете
//	//Запрос = Новый Запрос;
//	//Запрос.Текст =  "ВЫБРАТЬ
//	//|РеализацияТоваровУслуг.Ссылка КАК Ссылка
//	//|ИЗ
//	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//	//|ГДЕ
//	//|	РеализацияТоваровУслуг.АгентскиеУслуги.ДоговорКонтрагента = &ДоговорКонтрагента
//	//|	И РеализацияТоваровУслуг.Проведен = Истина
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	РеализацияТоваровУслуг.Ссылка";
//	//
//	//Запрос.УстановитьПараметр("ДоговорКонтрагента", ЭтотОбъект.ДоговорКонтрагента.Ссылка);
//	//
//	//    
//	//Результат = Запрос.Выполнить();
//	//Выборка = Результат.Выбрать();

//	//Пока Выборка.Следующий() Цикл
//	//	Док = Выборка.Ссылка.ПолучитьОбъект();
//	//	Док.Записать(РежимЗаписиДокумента.Проведение);
//	//КонецЦикла;
	
