
&Перед("ОбработкаЗаполнения")
Процедура ЭТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		Если ТипДанныхЗаполнения = Тип("Структура") Тогда
			Если ДанныеЗаполнения.Свойство("Дата") Тогда
				Дата = ДанныеЗаполнения.Дата;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ДоговорКонтрагента") и ДанныеЗаполнения.Свойство("Основание") Тогда
				Основание = ДанныеЗаполнения.Основание;
				Если ТипЗНЧ(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					НовСтр = ЭтотОбъект.Услуги.Добавить();					
					НовСтр.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Услуги по договору");
					НовСтр.Содержание = Строка(ДанныеЗаполнения.ДоговорКонтрагента);
					НовСтр.Количество = 1;                
					Если ДанныеЗаполнения.Свойство("СуммаОплат") Тогда
						НовСтр.Цена = ДанныеЗаполнения.СуммаОплат;
						НовСтр.Сумма = ДанныеЗаполнения.СуммаОплат;
					Иначе
						НовСтр.Цена = ДанныеЗаполнения.СуммаДокумента;
						НовСтр.Сумма = ДанныеЗаполнения.СуммаДокумента;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

