Функция ПолучитьКомиссиюТОПоУмолчанию(Организация,Контрагент) ЭКСПОРТ
	КВозврату = Новый Структура("Контрагент,МетодРасчета,Процент,Фиксированная,НашДоговор,ИспользуемыйТипДаты,Сообщение,Ошибки");
	КВозврату.Контрагент = Контрагент;
	КВозврату.Сообщение = "Параметры комиссии ТО по умолчанию не заданы.";
	КВозврату.Ошибки = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭТ_КомиссияТО_ПоУмолчанию.МетодРасчета КАК МетодРасчета,
		|	ЭТ_КомиссияТО_ПоУмолчанию.Процент КАК Процент,
		|	ЭТ_КомиссияТО_ПоУмолчанию.Фиксированная КАК Фиксированная,
		|	ЭТ_КомиссияТО_ПоУмолчанию.Контрагент КАК Контрагент,
		|	ЭТ_КомиссияТО_ПоУмолчанию.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ЭТ_КомиссияТО_ПоУмолчанию КАК ЭТ_КомиссияТО_ПоУмолчанию
		|ГДЕ
		|	ЭТ_КомиссияТО_ПоУмолчанию.Контрагент = &Контрагент
		|	И ЭТ_КомиссияТО_ПоУмолчанию.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КВозврату.МетодРасчета = ВыборкаДетальныеЗаписи.МетодРасчета;
		КВозврату.Процент = ВыборкаДетальныеЗаписи.Процент;
		КВозврату.Фиксированная = ВыборкаДетальныеЗаписи.Фиксированная;  
		КВозврату.Сообщение = "";
		КВозврату.Ошибки = Ложь;
	КонецЦикла;                       
	Возврат КВозврату;
КонецФункции

