//ЗаполнитьСписокВалют()
//Получает в СБ список валют и заполняет данным списком элемет формы ВалютаДокументов
&НаСервере
Процедура ЗаполнитьСписокВалют()
	Элементы.ВалютаДокументов.СписокВыбора.Очистить();
	Для Каждого СледЭлемент Из ЭТ_ОбщийМодуль2.Сurrency() Цикл
		Элементы.ВалютаДокументов.СписокВыбора.Добавить(СледЭлемент.id,СледЭлемент.name);
	КонецЦикла;
КонецПроцедуры

//ЗаполнитьПользовательЮОН()
//получает в СБ список менеджеров и заполняет им элемент формы ПользовательЮОН
&НаСервере
Процедура ЗаполнитьПользовательЮОН()
	Элементы.ПользовательЮОН.СписокВыбора.Очистить();
	Для Каждого СледЭлемент Из ЭТ_ОбщийМодуль2.Manager() Цикл
		ИмяЭлемента="";
		Если СледЭлемент.Свойство("u_surname") Тогда ИмяЭлемента=СокрЛП(СокрЛП(ИмяЭлемента)+" "+СокрЛП(СледЭлемент.u_surname)) КонецЕсли;
		Если СледЭлемент.Свойство("u_name") Тогда ИмяЭлемента=СокрЛП(СокрЛП(ИмяЭлемента)+" "+СокрЛП(СледЭлемент.u_name)) КонецЕсли;
		Если СледЭлемент.Свойство("u_email") Тогда ИмяЭлемента=СокрЛП(СокрЛП(ИмяЭлемента)+" "+СокрЛП(СледЭлемент.u_email)) КонецЕсли;		
		Элементы.ПользовательЮОН.СписокВыбора.Добавить(СледЭлемент.u_id,ИмяЭлемента);
	КонецЦикла;
КонецПроцедуры

//ЗаполнитьТипТО()
//получает из СБ тип партнера и заполняет им элемекнт формы ТуроператорыТипТО
&НаСервере
Процедура ЗаполнитьТипТО()
	Элементы.ТуроператорыТипТО.СписокВыбора.Очистить();
	Для Каждого СледЭлемент Из ЭТ_ОбщийМодуль2.SupplierType() Цикл
		Элементы.ТуроператорыТипТО.СписокВыбора.Добавить(СледЭлемент.id,СледЭлемент.name);
	КонецЦикла;
КонецПроцедуры


//ЗаполнитьСписокКасс()
//получает из СБ список касс и заполняет им  элементы формы
//-КассаТО
//-КассаКлиентНал
//-КассаКлиентБезнал
//-КассаКлиентКарта
//-ВидыОплатЮОНКассаЮОН
&НаСервере
Процедура ЗаполнитьСписокКасс()
	Элементы.КассаТО.СписокВыбора.Очистить();
	Элементы.КассаКлиентНал.СписокВыбора.Очистить();
	Элементы.КассаКлиентБезнал.СписокВыбора.Очистить();
	Элементы.КассаКлиентКарта.СписокВыбора.Очистить();
	Элементы.ВидыОплатЮОНКассаЮОН.СписокВыбора.Очистить();
	Для Каждого СледКасса Из ЭТ_ОбщийМодуль2.Сash() Цикл
		Элементы.КассаТО.СписокВыбора.Добавить(СледКасса.id,СледКасса.name);
		Элементы.КассаКлиентНал.СписокВыбора.Добавить(СледКасса.id,СледКасса.name);
		Элементы.КассаКлиентБезнал.СписокВыбора.Добавить(СледКасса.id,СледКасса.name);
		Элементы.КассаКлиентКарта.СписокВыбора.Добавить(СледКасса.id,СледКасса.name);
		Элементы.ВидыОплатЮОНКассаЮОН.СписокВыбора.Добавить(СледКасса.name+" ["+Строка(СледКасса.id)+"] ");		
	КонецЦикла;
КонецПроцедуры

//СохранитьНастройку(КлючНастроек,Настройки)
//сохраняет конкретную настройку пользователя (КлючНастроек, Настройки)
&НаСервере
Процедура СохранитьНастройку(КлючНастроек,Настройки)	
	КлючОбъекта  = "ЭТ";
    ИмяПользователя = ИмяПользователя();      	
    ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);
КонецПроцедуры

//ПолучитьНастройку(КлючНастроек)
//получает конкретную настройку пользователя (КлючНастроек)
&НаСервере
Функция ПолучитьНастройку(КлючНастроек)
	КлючОбъекта  = "ЭТ";
    ИмяПользователя = ИмяПользователя();
	Настройки = Неопределено;
    Попытка
        Настройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек,,ИмяПользователя);
    Исключение
        Настройки = Неопределено;
    КонецПопытки;

	Возврат Настройки;
КонецФункции

//Работа с настройками формы

//ПолучитьВсеНастройки()
//получает все имеющиеся настройки пользователя и выводит их на форму
&НаКлиенте
Процедура ПолучитьВсеНастройки()
	Объект.ApiKey=ПолучитьНастройку("ApiKey");
	Объект.Организация=ПолучитьНастройку("Организация"); 
	Объект.СчетОрганизации=ПолучитьНастройку("СчетОрганизации"); 
	Объект.КаталогПартнеров=ПолучитьНастройку("КаталогПартнеров"); 
	Объект.КаталогПоставщиков=ПолучитьНастройку("КаталогПоставщиков"); 
	Объект.ВидДоговораТО=ПолучитьНастройку("ВидДоговораТО"); 
	Объект.ВидДоговораПоставщик=ПолучитьНастройку("ВидДоговораПоставщик"); 
	Объект.ВидДоговораКлиент=ПолучитьНастройку("ВидДоговораКлиент"); 
	Объект.СтатьяДвиженияДенежныхСредств=ПолучитьНастройку("СтатьяДвиженияДенежныхСредств"); 
	Объект.РазрешитьПроведениеБезСБ=ПолучитьНастройку("РазрешитьПроведениеБезСБ"); 
	Объект.Префикс=ПолучитьНастройку("Префикс"); 
	Объект.ТестовыйРежим=ПолучитьНастройку("ТестовыйРежим"); 
	Объект.ТестоваяЗаявка=ПолучитьНастройку("ТестоваяЗаявка"); 
	Объект.ТестоваяЗаявкаЮОН=ПолучитьНастройку("ТестоваяЗаявкаЮОН"); 
	Объект.РежимАдминистратора=ПолучитьНастройку("РежимАдминистратора"); 
	Объект.КассаТО=ПолучитьНастройку("КассаТО"); 	
	Объект.КассаКлиентНал=ПолучитьНастройку("КассаКлиентНал"); 	
	Объект.КассаКлиентБезнал=ПолучитьНастройку("КассаКлиентБезнал"); 	
	Объект.КассаКлиентКарта=ПолучитьНастройку("КассаКлиентКарта"); 	
	Объект.ВалютаДокументов=ПолучитьНастройку("ВалютаДокументов"); 	
	Объект.ВалютаДокументов1С=ПолучитьНастройку("ВалютаДокументов1С"); 	
	Объект.КаталогЗаказчиков=ПолучитьНастройку("КаталогЗаказчиков"); 
	Объект.КаталогПомойки=ПолучитьНастройку("КаталогПомойки"); 
	Объект.ВидыОперацийОплатаПлатежнойКартой=ПолучитьНастройку("ВидыОперацийОплатаПлатежнойКартой"); 
	Объект.КомиссияБанкаКарта=ПолучитьНастройку("КомиссияБанкаКарта"); 
	Объект.УдалениеДоговоров=ПолучитьНастройку("УдалениеДоговоров"); 
	Объект.УдалениеКонтрагентов=ПолучитьНастройку("УдалениеКонтрагентов"); 
	Объект.ВыключитьМодуль=ПолучитьНастройку("ВыключитьМодуль"); 
	Объект.СтатьяДвиженияДенежныхСредствКлиент=ПолучитьНастройку("СтатьяДвиженияДенежныхСредствКлиент"); 
	Объект.РеализацияСчетРасчетовТО=ПолучитьНастройку("РеализацияСчетРасчетовТО"); 
	Объект.КурсыВалютСсылка=ПолучитьНастройку("КурсыВалютСсылка"); 	
	Объект.КурсыВалютСервер=ПолучитьНастройку("КурсыВалютСервер");
	Объект.РеализацияНоменклатураВУслугах=ПолучитьНастройку("РеализацияНоменклатураВУслугах");
	Объект.РеализацияСчетДоходовВУслугах=ПолучитьНастройку("РеализацияСчетДоходовВУслугах");
	Объект.РеализацияСчетРасходовВУслугах=ПолучитьНастройку("РеализацияСчетРасходовВУслугах");
	Объект.РеализацияСчетУчетаНДСВУслугах=ПолучитьНастройку("РеализацияСчетУчетаНДСВУслугах");
	Объект.ОтчетКомитентаУслугаПоВознаграждению=ПолучитьНастройку("ОтчетКомитентаУслугаПоВознаграждению");
	Объект.ОтчетКомитентаСчетУчетаДоходов=ПолучитьНастройку("ОтчетКомитентаСчетУчетаДоходов");
	Объект.ОтчетКомитентаНоменклатурнаяГруппа=ПолучитьНастройку("ОтчетКомитентаНоменклатурнаяГруппа");
	Объект.ОтчетКомитентаСпособРасчета=ПолучитьНастройку("ОтчетКомитентаСпособРасчета");
	Объект.ОтчетКомитентаУдержатьВознаграждение=ПолучитьНастройку("ОтчетКомитентаУдержатьВознаграждение");
	Объект.ОтчетКомитентаДСВидОтчетаПоПлатежам=ПолучитьНастройку("ОтчетКомитентаДСВидОтчетаПоПлатежам");
	Объект.ОтчетКомитентаСчетУчетаРасчетовСКонтрагентом=ПолучитьНастройку("ОтчетКомитентаСчетУчетаРасчетовСКонтрагентом");
	Объект.ОтчетКомитентаСчетУчетаРасчетовПоАвансам=ПолучитьНастройку("ОтчетКомитентаСчетУчетаРасчетовПоАвансам");
	Объект.ТуроператорыТипТО=ПолучитьНастройку("ТуроператорыТипТО");
	Объект.ТуроператорыУведомленияНовыйВЮОН=ПолучитьНастройку("ТуроператорыУведомленияНовыйВЮОН");
	Объект.УникальностьДоговораКлиента=ПолучитьНастройку("УникальностьДоговораКлиента");
	Объект.ПользовательЮОН=ПолучитьНастройку("ПользовательЮОН"); 	
	Объект.КолВоПопытокЮОН=ПолучитьНастройку("КолВоПопытокЮОН"); 	
	Объект.АдресРеестраЭквайринга=ПолучитьНастройку("АдресРеестраЭквайринга"); 	
	Объект.УведомленияОбОшибкахПлатежейПокупателей=ПолучитьНастройку("УведомленияОбОшибкахПлатежейПокупателей"); 	
	Объект.ПроводитьПлатежныеДокументыСОшибкамиПокупатели=ПолучитьНастройку("ПроводитьПлатежныеДокументыСОшибкамиПокупатели"); 	
	Объект.ПроводитьПлатежныеДокументыСОшибкамиПоставщиков=ПолучитьНастройку("ПроводитьПлатежныеДокументыСОшибкамиПоставщиков"); 	
	Объект.УведомленияОбОшибкахПлатежейПоставщиков=ПолучитьНастройку("УведомленияОбОшибкахПлатежейПоставщиков"); 	
	Объект.РеализацияКомиссияТО=ПолучитьНастройку("РеализацияКомиссияТО");
	Объект.ТуроператорыЗапретСозданияВЮОН=ПолучитьНастройку("ТуроператорыЗапретСозданияВЮОН");
	Объект.ОтчетКомитентаДополнительноеВознаграждение=ПолучитьНастройку("ОтчетКомитентаДополнительноеВознаграждение");	
	Объект.ОтчетКомитентаДополнительноеВознаграждениеГруппа=ПолучитьНастройку("ОтчетКомитентаДополнительноеВознаграждениеГруппа");		
	Объект.КлиентыПриоритетЗаказчикаВПлатеже=ПолучитьНастройку("КлиентыПриоритетЗаказчикаВПлатеже");		
	Объект.ЭквайрингТипУслуги=ПолучитьНастройку("ЭквайрингТипУслуги");		
	Объект.ОсновныеКешированиеСекунды=ПолучитьНастройку("ОсновныеКешированиеСекунды");		
	Объект.РеализацияСодержаниеУслуги=ПолучитьНастройку("РеализацияСодержаниеУслуги");		
	Объект.РеализацияКодПакетнойУслуги=ПолучитьНастройку("РеализацияКодПакетнойУслуги");		
	Объект.ОсновныеГруппаБанков=ПолучитьНастройку("ОсновныеГруппаБанков");		
	Объект.РеализацияИсключитьУслугиБанков=ПолучитьНастройку("РеализацияИсключитьУслугиБанков");
	Объект.ТуроператорыИспользоватьШаблонДоговора=ПолучитьНастройку("ТуроператорыИспользоватьШаблонДоговора");
	Объект.РеализацияЧекДопВознаграждениеПризнакАгента=ПолучитьНастройку("РеализацияЧекДопВознаграждениеПризнакАгента");
	Объект.ЧекПризнакСпособаРасчета=ПолучитьНастройку("ЧекПризнакСпособаРасчета");	
	Объект.ЧекПризнакПредметаРасчета=ПолучитьНастройку("ЧекПризнакПредметаРасчета");	
	Объект.РеализацияЗакрываетЗаявку=ПолучитьНастройку("РеализацияЗакрываетЗаявку");	
	Объект.ОрганизацияДопуск=ПолучитьНастройку("ОрганизацияДопуск");	      
	Объект.ДатаЗакрытияРасчетныхДокументов=ПолучитьНастройку("ДатаЗакрытияРасчетныхДокументов");	      	
	Объект.УведомлятьМенеджераОбОплатеКлиентаНаПочту=ПолучитьНастройку("УведомлятьМенеджераОбОплатеКлиентаНаПочту");	   
	Объект.ОтражениеАвансаАгенты=ПолучитьНастройку("ОтражениеАвансаАгенты");
	Объект.ОтражениеАвансаПоставщики=ПолучитьНастройку("ОтражениеАвансаПоставщики");    
	Объект.РеализацияСчетДоходовВУслугах=ПолучитьНастройку("РеализацияСчетДоходовВУслугах");
	Объект.РеализацияУслугиСубконто=ПолучитьНастройку("РеализацияУслугиСубконто");	
	Объект.РеализацияАгентскиеУслугиБезОплаты=ПолучитьНастройку("РеализацияАгентскиеУслугиБезОплаты");		
КонецПроцедуры

//СохранитьВсеНастройки()
//сохраняет все настройки заданные на форме в настройки пользователя
&НаСервере
Процедура СохранитьВсеНастройки()
	СохранитьНастройку("ApiKey",Объект.ApiKey);	
	СохранитьНастройку("Организация",Объект.Организация);	
	СохранитьНастройку("СчетОрганизации",Объект.СчетОрганизации);	
	СохранитьНастройку("КаталогПартнеров",Объект.КаталогПартнеров);		
	СохранитьНастройку("КаталогПоставщиков",Объект.КаталогПоставщиков);		
	СохранитьНастройку("ВидДоговораТО",Объект.ВидДоговораТО);	
	СохранитьНастройку("ВидДоговораПоставщик",Объект.ВидДоговораПоставщик);	
	СохранитьНастройку("ВидДоговораКлиент",Объект.ВидДоговораКлиент);	
	СохранитьНастройку("СтатьяДвиженияДенежныхСредств",Объект.СтатьяДвиженияДенежныхСредств);	
	СохранитьНастройку("РазрешитьПроведениеБезСБ",Объект.РазрешитьПроведениеБезСБ);	
	СохранитьНастройку("ТестовыйРежим",Объект.ТестовыйРежим);	
	СохранитьНастройку("ТестоваяЗаявка",Объект.ТестоваяЗаявка);	
	СохранитьНастройку("ТестоваяЗаявкаЮОН",Объект.ТестоваяЗаявкаЮОН);	
	СохранитьНастройку("Префикс",Объект.Префикс);	
	СохранитьНастройку("РежимАдминистратора",Объект.РежимАдминистратора);	
	СохранитьНастройку("КассаТО",Объект.КассаТО);			
	СохранитьНастройку("КассаКлиентНал",Объект.КассаКлиентНал);			
	СохранитьНастройку("КассаКлиентБезнал",Объект.КассаКлиентБезнал);			
	СохранитьНастройку("КассаКлиентКарта",Объект.КассаКлиентКарта);			
	СохранитьНастройку("ВалютаДокументов",Объект.ВалютаДокументов);		
	СохранитьНастройку("ВалютаДокументов1С",Объект.ВалютаДокументов1С);		
	СохранитьНастройку("КаталогЗаказчиков",Объект.КаталогЗаказчиков);	
	СохранитьНастройку("ВидыОперацийОплатаПлатежнойКартой",Объект.ВидыОперацийОплатаПлатежнойКартой);	
	СохранитьНастройку("КомиссияБанкаКарта",Объект.КомиссияБанкаКарта);	
	СохранитьНастройку("ВидыОплатЮОН",Объект.ВидыОплатЮОН.Выгрузить());	
	СохранитьНастройку("КаталогПомойки",Объект.КаталогПомойки);	
	СохранитьНастройку("ВыключитьМодуль",Объект.ВыключитьМодуль);	
	СохранитьНастройку("ТуроператорыУведомленияНовыйВЮОН",Объект.ТуроператорыУведомленияНовыйВЮОН);	
	СохранитьНастройку("ПользовательЮОН",Объект.ПользовательЮОН);	
	СохранитьНастройку("УдалениеДоговоров",Объект.УдалениеДоговоров);	
	СохранитьНастройку("УдалениеКонтрагентов",Объект.УдалениеКонтрагентов);	
	СохранитьНастройку("СтатьяДвиженияДенежныхСредствКлиент",Объект.СтатьяДвиженияДенежныхСредствКлиент);	
	СохранитьНастройку("РеализацияСчетРасчетовТО",Объект.РеализацияСчетРасчетовТО);	
	СохранитьНастройку("КурсыВалютСсылка",Объект.КурсыВалютСсылка);	
	СохранитьНастройку("КурсыВалютСервер",Объект.КурсыВалютСервер);	
	СохранитьНастройку("РеализацияНоменклатураВУслугах",Объект.РеализацияНоменклатураВУслугах);	
	СохранитьНастройку("РеализацияСчетДоходовВУслугах",Объект.РеализацияСчетДоходовВУслугах);	
	СохранитьНастройку("РеализацияСчетУчетаНДСВУслугах",Объект.РеализацияСчетУчетаНДСВУслугах);		
	СохранитьНастройку("РеализацияСчетРасходовВУслугах",Объект.РеализацияСчетРасходовВУслугах);	
	СохранитьНастройку("ОтчетКомитентаУслугаПоВознаграждению",Объект.ОтчетКомитентаУслугаПоВознаграждению);	
	СохранитьНастройку("ОтчетКомитентаСчетУчетаДоходов",Объект.ОтчетКомитентаСчетУчетаДоходов);	
	СохранитьНастройку("ОтчетКомитентаНоменклатурнаяГруппа",Объект.ОтчетКомитентаНоменклатурнаяГруппа);	
	СохранитьНастройку("ОтчетКомитентаСпособРасчета",Объект.ОтчетКомитентаСпособРасчета);	
	СохранитьНастройку("ОтчетКомитентаУдержатьВознаграждение",Объект.ОтчетКомитентаУдержатьВознаграждение);	
	СохранитьНастройку("ОтчетКомитентаДСВидОтчетаПоПлатежам",Объект.ОтчетКомитентаДСВидОтчетаПоПлатежам);	
	СохранитьНастройку("ОтчетКомитентаСчетУчетаРасчетовСКонтрагентом",Объект.ОтчетКомитентаСчетУчетаРасчетовСКонтрагентом);	
	СохранитьНастройку("ОтчетКомитентаСчетУчетаРасчетовПоАвансам",Объект.ОтчетКомитентаСчетУчетаРасчетовПоАвансам);	
	СохранитьНастройку("ТуроператорыТипТО",Объект.ТуроператорыТипТО);	
	СохранитьНастройку("УникальностьДоговораКлиента",Объект.УникальностьДоговораКлиента);	
	СохранитьНастройку("ПлатежкаОснование",Объект.ПлатежкаОснование.Выгрузить());	
	СохранитьНастройку("КолВоПопытокЮОН",Объект.КолВоПопытокЮОН);	
	СохранитьНастройку("АдресРеестраЭквайринга",Объект.АдресРеестраЭквайринга);	
	СохранитьНастройку("УведомленияОбОшибкахПлатежейПокупателей",Объект.УведомленияОбОшибкахПлатежейПокупателей);	
	СохранитьНастройку("ПроводитьПлатежныеДокументыСОшибкамиПокупатели",Объект.ПроводитьПлатежныеДокументыСОшибкамиПокупатели);	
	СохранитьНастройку("ПроводитьПлатежныеДокументыСОшибкамиПоставщиков",Объект.ПроводитьПлатежныеДокументыСОшибкамиПоставщиков);	
	СохранитьНастройку("УведомленияОбОшибкахПлатежейПоставщиков",Объект.УведомленияОбОшибкахПлатежейПоставщиков);	
	СохранитьНастройку("РеализацияКомиссияТО",Объект.РеализацияКомиссияТО);	
	СохранитьНастройку("ТуроператорыЗапретСозданияВЮОН",Объект.ТуроператорыЗапретСозданияВЮОН);		
	СохранитьНастройку("ОтчетКомитентаДополнительноеВознаграждение",Объект.ОтчетКомитентаДополнительноеВознаграждение);	
	СохранитьНастройку("ОтчетКомитентаДополнительноеВознаграждениеГруппа",Объект.ОтчетКомитентаДополнительноеВознаграждениеГруппа);		
	СохранитьНастройку("КлиентыПриоритетЗаказчикаВПлатеже",Объект.КлиентыПриоритетЗаказчикаВПлатеже);		
	СохранитьНастройку("ЭквайрингТипУслуги",Объект.ЭквайрингТипУслуги);		
	СохранитьНастройку("ОсновныеКешированиеСекунды",Объект.ОсновныеКешированиеСекунды);		
	СохранитьНастройку("РеализацияСодержаниеУслуги",Объект.РеализацияСодержаниеУслуги);		
	СохранитьНастройку("РеализацияКодПакетнойУслуги",Объект.РеализацияКодПакетнойУслуги);		
	СохранитьНастройку("ОсновныеГруппаБанков",Объект.ОсновныеГруппаБанков);		
	СохранитьНастройку("РеализацияИсключитьУслугиБанков",Объект.РеализацияИсключитьУслугиБанков);		
	СохранитьНастройку("НаименованиеУслуги",Объект.НаименованиеУслуги.Выгрузить());	
	СохранитьНастройку("ТуроператорыИспользоватьШаблонДоговора",Объект.ТуроператорыИспользоватьШаблонДоговора);	
	СохранитьНастройку("РеализацияЧекДопВознаграждениеПризнакАгента",Объект.РеализацияЧекДопВознаграждениеПризнакАгента);
	СохранитьНастройку("ЧекПризнакСпособаРасчета",Объект.ЧекПризнакСпособаРасчета);	
	СохранитьНастройку("ЧекПризнакПредметаРасчета",Объект.ЧекПризнакПредметаРасчета);	   
	СохранитьНастройку("РеализацияЗакрываетЗаявку",Объект.РеализацияЗакрываетЗаявку);
	СохранитьНастройку("ОрганизацияДопуск",Объект.ОрганизацияДопуск);  
	СохранитьНастройку("ДатаЗакрытияРасчетныхДокументов",Объект.ДатаЗакрытияРасчетныхДокументов);  
	СохранитьНастройку("УведомлятьМенеджераОбОплатеКлиентаНаПочту",Объект.УведомлятьМенеджераОбОплатеКлиентаНаПочту);         
	СохранитьНастройку("ОтражениеАвансаАгенты",Объект.ОтражениеАвансаАгенты);         
	СохранитьНастройку("ОтражениеАвансаПоставщики",Объект.ОтражениеАвансаПоставщики);  
	СохранитьНастройку("РеализацияСчетДоходовВУслугах",Объект.РеализацияСчетДоходовВУслугах);  	
	СохранитьНастройку("РеализацияУслугиСубконто",Объект.РеализацияУслугиСубконто);  		
	СохранитьНастройку("РеализацияАгентскиеУслугиБезОплаты",Объект.РеализацияАгентскиеУслугиБезОплаты);  			
КонецПроцедуры

//СохранитьНастройкуНажатие(Элемент)
//реакция на нажатие кнопки Сохранить
&НаКлиенте
Процедура СохранитьНастройкуНажатие(Элемент)
	СохранитьВсеНастройки()
КонецПроцедуры

//ПриОткрытииНаСервере()
//при открытии окна формирует его содержимое
&НаСервере
Процедура ПриОткрытииНаСервере()
	ЗаполнитьСписокКасс();
	ЗаполнитьСписокВалют();
	ЗаполнитьПользовательЮОН();
	ЗаполнитьТипТО();
	ЭквайрингТипУслуги();
	Заполнить_РеализацияКодПакетнойУслуги();
	ТабВидовОплат = ПолучитьНастройку("ВидыОплатЮОН");
	Если Строка(ТипЗнч(ТабВидовОплат)) = "Таблица значений" Тогда
		Объект.ВидыОплатЮОН.Загрузить(ТабВидовОплат)
	КонецЕсли;
	ПлатежкаОснование = ПолучитьНастройку("ПлатежкаОснование");
	Если Строка(ТипЗнч(ПлатежкаОснование)) = "Таблица значений" Тогда
		Объект.ПлатежкаОснование.Загрузить(ПлатежкаОснование)
	КонецЕсли;
	НаименованиеУслуги = ПолучитьНастройку("НаименованиеУслуги");
	Если Строка(ТипЗнч(НаименованиеУслуги)) = "Таблица значений" Тогда
		Объект.НаименованиеУслуги.Загрузить(НаименованиеУслуги)
	КонецЕсли;
	
КонецПроцедуры

//ЭтоАдминистратор()
//определяет ли пользователь администратором
&НаСервере
Функция ЭтоАдминистратор()
	КВозврату = Ложь;
	Если РольДоступна("АдминистраторСистемы") или РольДоступна("Администрирование") Тогда
		КВозврату = Истина;
	КонецЕсли;	
	Возврат КВозврату;
КонецФункции

&НаСервере
Функция ПолучитьТипыУслуг()
	Возврат ЭТ_ОбщийМодуль2.ТипыУслуг();
КонецФункции

//ПриОткрытии(Отказ)
//при открытии на форме определяет структуры элементов
&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	Если СтрНайти(нрег(ПользователиКлиентСервер.ТекущийПользователь()),нрег("уралфинанс"))>0 Тогда      
		Отказ = Истина;
		Предупреждение("Вам запрещено менять настройки");
		Возврат;
	КонецЕсли;
	Элементы.Организация.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
	Элементы.СчетОрганизации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	Элементы.КаталогПартнеров.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");	
	Элементы.КаталогПоставщиков.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");	
	Элементы.ВидДоговораТО.ОграничениеТипа  = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровКонтрагентов");	
	Элементы.ВидДоговораПоставщик.ОграничениеТипа  = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровКонтрагентов");	
	Элементы.ВидДоговораКлиент.ОграничениеТипа  = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровКонтрагентов");	
	Элементы.СтатьяДвиженияДенежныхСредств.ОграничениеТипа  = Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств");	
	Элементы.СтатьяДвиженияДенежныхСредствКлиент.ОграничениеТипа  = Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств");	
	ЭтаФорма.Элементы.ТекущийЕмайл.Заголовок = "Персональные уведомления на почту: ["+ТекущийЕмайлНаСервере()+"] справочник сотрудников или справочник физических лиц";
	ЭтаФорма.Элементы.ТекущийЕмайл.Видимость = Истина;
	ПолучитьВсеНастройки();
	ПриОткрытииНаСервере();
	Если ЭтоАдминистратор() Тогда
		ЭтаФорма.Элементы.Группа3.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.Группа3.Видимость = Ложь;		
	КонецЕсли;
	
	ЭтаФорма.Элементы.НаименованиеУслугиТипУслуги.СписокВыбора.Очистить();
	ЭтаФорма.Элементы.НаименованиеУслугиТипУслуги.РежимВыбораИзСписка = Истина;
	//ЭтаФорма.Элементы.НаименованиеУслугиТипУслуги.
	
	Для Каждого Метаданное из ПолучитьТипыУслуг() Цикл
   		ЭтаФорма.Элементы.НаименованиеУслугиТипУслуги.СписокВыбора.Добавить(Метаданное.Значение, Метаданное.Представление);
	КонецЦикла;


	//ЭтаФорма.Элементы.РеализацияСодержаниеУслуги.СписокВыбора.ЗагрузитьЗначения(ЭТ_ОбщийМодуль2.ТипыУслуг());
КонецПроцедуры

//Команда1НаСервере()
//реакция нажатия кнопки Сохранить (клиент/сервер)
&НаСервере
Процедура Команда1НаСервере()
	СохранитьВсеНастройки();
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
	ЭтотОбъект.Закрыть();
КонецПроцедуры

//ТекущийЕмайлНаСервере()
//из контактной информации пользователя вытаскивает эл.почту
&НаСервере
Функция ТекущийЕмайлНаСервере()
	Возврат ЭТ_ОбщийМодуль2.ПолучитьКонтактСотрудника(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,ПользователиКлиентСервер.ТекущийПользователь().ФизическоеЛицо.Ссылка);
КонецФункции

//ТекущийЕмайл()	
//на клиенте возвращает эл.почту тек.пользователя
&НаКлиенте
Функция ТекущийЕмайл()	
	Возврат ТекущийЕмайлНаСервере();
КонецФункции

//ЭквайрингТипУслуги()
//Получает в СБ список услуг и заполняет данным списком элемет формы Эквайринг.ТипУслуги
&НаСервере
Процедура ЭквайрингТипУслуги()
	Элементы.ЭквайрингТипУслуги.СписокВыбора.Очистить();
	Для Каждого Метаданное из ЭТ_ОбщийМодуль2.ТипыУслуг() Цикл
   		Элементы.ЭквайрингТипУслуги.СписокВыбора.Добавить(Метаданное.Значение, Метаданное.Представление);
	КонецЦикла;
	//Элементы.ЭквайрингТипУслуги.СписокВыбора.ЗагрузитьЗначения(ЭТ_ОбщийМодуль2.ТипыУслуг());
КонецПроцедуры


//ЭквайрингТипУслуги()
//Получает в СБ список услуг и заполняет данным списком элемет формы Эквайринг.ТипУслуги
&НаСервере
Процедура Заполнить_РеализацияКодПакетнойУслуги()
	Элементы.РеализацияКодПакетнойУслуги.СписокВыбора.Очистить();
	Для Каждого СледЭлемент Из ЭТ_ОбщийМодуль2.ServiceType() Цикл
		Элементы.РеализацияКодПакетнойУслуги.СписокВыбора.Добавить(СледЭлемент.id,СледЭлемент.name);
	КонецЦикла;
КонецПроцедуры


//далее идут эксперперементальные функции, которые не внедрены
//попытка сохранять настройки в файл - пока не реализована

//ПолучитьИмяФайла(Режим)
//получает имя файла
&НаКлиенте
Функция ПолучитьИмяФайла(Режим)
 ВыборФайла = Новый ДиалогВыбораФайла(Режим);
 ВыборФайла.ПолноеИмяФайла = "";
 Фильтр = "Таблица значений 1С(*.1ct)|*.1ct";
 ВыборФайла.Фильтр = Фильтр;
 ВыборФайла.МножественныйВыбор = Ложь;
 ВыборФайла.Выбрать(); 
 Возврат ВыборФайла.ПолноеИмяФайла;
КонецФункции

//
&НаСервере
Процедура Команда2НаСервере()	
	ЭТ_Почта.ОтправитьПисьмо(ЭТ_ОбщийМодуль2.СписокАдресовАдмина(),"Действия пользователя " + ПользователиКлиентСервер.ТекущийПользователь(),"Содержание письма");
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Команда2НаСервере();
КонецПроцедуры




