//ЗаполнитьФормуПКО(Парам)
//на основании присланных данных заполняет данные формы
&НаСервере
Процедура ЗаполнитьФормуПКО(Парам)
	Объект.Контрагент = Парам.Контрагент;
	ЭтаФорма.РасшифровкаПлатежаДоговорКонтрагента = Парам.РасшифровкаПлатежаДоговорКонтрагента;
	Объект.ПринятоОт =  Парам.Контрагент;
	Объект.Основание = "Оплата по договору "+СокрЛП(ЭТ_ОбщийМодуль2.УдалитьДатуИзСтроки(Парам.РасшифровкаПлатежаДоговорКонтрагента));
	Объект.Комментарий =  "Оплата по договору "+СокрЛП(ЭТ_ОбщийМодуль2.УдалитьДатуИзСтроки(Парам.РасшифровкаПлатежаДоговорКонтрагента));
	ЭтаФорма.РасшифровкаПлатежаСпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Получить(0);
КонецПроцедуры

//НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
//по присланному номеру заявки выполняет поиск договора покупателя в 1С
&НаСервере
Функция НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
	ВидДоговораКлиент = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент");
	Если ТипЗНЧ(НомерЗаявки) = Тип("Строка") или ТипЗНЧ(НомерЗаявки) = Тип("Число") Тогда
		Запрос = Новый Запрос(" 
			|ВЫБРАТЬ 
			|	Ссылка, 
			|	Наименование 
			|ИЗ 
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.Номер = &НомерДоговора
			|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора 
			|	И Не ПометкаУдаления		
			|"); 
		Запрос.УстановитьПараметр("НомерДоговора", НомерЗаявки);	
		Запрос.УстановитьПараметр("ВидДоговора", ВидДоговораКлиент);		
		Результат = Запрос.Выполнить().Выбрать(); 
		Пока Результат.Следующий() Цикл 		
			Возврат Результат.Ссылка;
			Прервать;
		КонецЦикла;  
	ИначеЕсли ТипЗНЧ(НомерЗаявки) = Тип("Структура") Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидДоговора", ВидДоговораКлиент);		
		Запрос.Текст = " 
			|ВЫБРАТЬ 
			|	Ссылка, 
			|	Наименование 
			|ИЗ 
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ Не ПометкаУдаления
			|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора "; 
		Если НомерЗаявки.Свойство("id_internal") Тогда
			Префикс = СокрЛП(ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс","ЭТ18-")); 
			СтрокаПоиска = ВРег(СокрЛП(НомерЗаявки.id_internal)); 
			Если СтрНайти(СтрокаПоиска,ВРег(Префикс))=0 Тогда
				СтрокаПоиска = Префикс + СтрокаПоиска;
			КонецЕсли;
			НомерЗаявкиПоиск = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(СтрокаПоиска,Префикс);
			Запрос.Текст = Запрос.Текст + " И ДоговорыКонтрагентов.Номер ПОДОБНО &НомерДоговора ";
			Запрос.УстановитьПараметр("НомерДоговора", "%"+НомерЗаявкиПоиск+"%");;
		КонецЕсли;
		Если НомерЗаявки.Свойство("client_surname") Тогда
			ФамилияКлиентаПоиск = ВРег(СокрЛП(НомерЗаявки.client_surname)); 
			Запрос.Текст = Запрос.Текст + " И ВРег(ДоговорыКонтрагентов.Владелец.Наименование) ПОДОБНО &Контрагент ";
			Запрос.УстановитьПараметр("Контрагент", "%"+ВРег(ФамилияКлиентаПоиск)+"%");
		КонецЕсли;
		Результат = Запрос.Выполнить().Выбрать(); 
		Пока Результат.Следующий() Цикл 		
			Возврат Результат.Ссылка;
			Прервать;
		КонецЦикла;  
	КонецЕсли;
	Возврат ПоУмолчанию;
КонецФункции


//ВернутьКонтрагентаПоЗаявке(Заявка)
//по присланной заявке СБ возвращает контрагента в 1С
&НаСервере
Функция ВернутьКонтрагентаПоЗаявке(Заявка)
	//Получаем заявку
	Заказчик = ЭТ_ОбщийМодуль2.User(Новый Структура("id",Заявка.client_id));
	Запрос = Новый Запрос("
	| ВЫБРАТЬ ВложЗапрос.Приоритет, ВложЗапрос.Ссылка, ВложЗапрос.Наименование
	|	ИЗ(
	|	 	ВЫБРАТЬ 1 КАК Приоритет, Ссылка КАК Ссылка, Наименование КАК Наименование 
	|			ИЗ Справочник.Контрагенты КАК Контрагенты 
	|			ГДЕ Не ПометкаУдаления И Контрагенты.ИНН = &ИНН И Контрагенты.ИНН<>NULL
	|		ОБЪЕДИНИТЬ
	|	 	ВЫБРАТЬ 2 КАК Приоритет, Ссылка КАК Ссылка, Наименование КАК Наименование 
	|			ИЗ Справочник.Контрагенты КАК Контрагенты 
	|			ГДЕ Не ПометкаУдаления И (
	|				(Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортПолный И &ПаспортПолный<>NULL)
	|				ИЛИ (Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортНомер И &ПаспортНомер<>NULL)
	|				)
	|				И Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортДата 
	|				И Контрагенты.ДокументУдостоверяющийЛичность<>NULL И &ПаспортДата<>""""
	|	 	ОБЪЕДИНИТЬ 
	|		ВЫБРАТЬ 3 КАК Приоритет, Ссылка КАК Ссылка, Наименование КАК Наименование 
	|			ИЗ Справочник.Контрагенты КАК Контрагенты 
	|			ГДЕ Не ПометкаУдаления И (
	|				(Контрагенты.НаименованиеПолное ПОДОБНО &Фамилия И &Фамилия <> NULL)
	|				И(Контрагенты.НаименованиеПолное ПОДОБНО &Имя И &Имя <> NULL)
	|				И(Контрагенты.НаименованиеПолное ПОДОБНО &Отчество И &Отчество <> NULL)
	|				)
	| 		ОБЪЕДИНИТЬ 
	|		ВЫБРАТЬ 4 КАК Приоритет, Ссылка КАК Ссылка, Наименование КАК Наименование 
	|			ИЗ Справочник.Контрагенты КАК Контрагенты 
	|			ГДЕ Не ПометкаУдаления И (
	|				(Контрагенты.НаименованиеПолное ПОДОБНО &Фамилия И &Фамилия <> NULL)
	|				И(Контрагенты.НаименованиеПолное ПОДОБНО &Имя И &Имя <> NULL)
	|				)
	|	 	ОБЪЕДИНИТЬ 
	|		ВЫБРАТЬ 5 КАК Приоритет, Ссылка КАК Ссылка, Наименование КАК Наименование 
	|			ИЗ Справочник.Контрагенты КАК Контрагенты 
	|			ГДЕ Не ПометкаУдаления 
	|				И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ПаспортПолный 
	|				И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>""""
	|				И &ПаспортПолный<>NULL	
	|	) КАК ВложЗапрос
	|	УПОРЯДОЧИТЬ ПО ВложЗапрос.Приоритет ВОЗР
	|"); 
	
	ИННЗаказчика = NULL;
	Если Заказчик.Свойство("u_inn") Тогда ИННЗаказчика = Заказчик.u_inn; КонецЕсли;
	Запрос.УстановитьПараметр("ИНН", ИННЗаказчика);	
	
	НомерПаспорта = NULL;
	Если Заказчик.Свойство("u_passport_number") Тогда 
		ПаспортПолный = "%"+СокрЛП(Заказчик.u_passport_number)+"%"; 
		НомерПаспорта = "%"+Прав(СокрЛП(Заказчик.u_passport_number),6)+"%"; 
	КонецЕсли;
	Запрос.УстановитьПараметр("ПаспортПолный", ПаспортПолный);
	Запрос.УстановитьПараметр("ПаспортНомер", НомерПаспорта);
	
	ДатаПаспорта = "";
	Если Заказчик.Свойство("u_passport_date") Тогда Если СтрДлина(СокрЛП(Заказчик.Свойство("u_passport_date")))>0 Тогда ДатаПаспорта = Заказчик.u_passport_date; КонецЕсли; КонецЕсли;
	Запрос.УстановитьПараметр("ПаспортДата", "%"+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(ДатаПаспорта)+"%");
	
	ФамилияЗаказчика = NULL;
	Если Заказчик.Свойство("u_surname") Тогда ФамилияЗаказчика = "%"+СокрЛП(Заказчик.u_surname)+"%"; КонецЕсли;	
	Запрос.УстановитьПараметр("Фамилия", ФамилияЗаказчика);
	
	ИмяЗаказчика = NULL;
	Если Заказчик.Свойство("u_name") Тогда ИмяЗаказчика = "%"+СокрЛП(Заказчик.u_name)+"%"; КонецЕсли;	
	Запрос.УстановитьПараметр("Имя", ИмяЗаказчика);
	
	ОтчествоЗаказчика = NULL;
	Если Заказчик.Свойство("u_sname") Тогда ОтчествоЗаказчика = "%"+СокрЛП(Заказчик.u_sname)+"%"; КонецЕсли;	
	Запрос.УстановитьПараметр("Отчество", ОтчествоЗаказчика);
	
	ДатаРожденияЗаказчика = "";
	Если Заказчик.Свойство("u_birthday") Тогда Если СтрДлина(СокрЛП(Заказчик.Свойство("u_birthday")))>0 Тогда  ДатаРожденияЗаказчика = Заказчик.u_birthday; КонецЕсли;	КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаРождения", ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(ДатаРожденияЗаказчика));
	
	Результат = Запрос.Выполнить().Выбрать();
	НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка();	
	Пока Результат.Следующий() Цикл 
		НайденКонтрагент = Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	
	Если НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		НайденКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		//Физик или Юрик
		Если СтрДлина(СокрЛП(Заказчик.u_company))>0 Тогда
			//заполняем юрика
			НайденКонтрагент.Наименование = Заказчик.u_company;
			НайденКонтрагент.НаименованиеПолное = Заказчик.u_company;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			НайденКонтрагент.ИНН =  Заказчик.u_inn;			
		Иначе
			//заполняем физика
			НайденКонтрагент.Наименование = Заказчик.u_surname+" "+Заказчик.u_name+" "+Заказчик.u_sname;
			НайденКонтрагент.НаименованиеПолное = Заказчик.u_surname+" "+Заказчик.u_name+" "+Заказчик.u_sname;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			НайденКонтрагент.ИНН =  Заказчик.u_inn;
			
			Паспорт = "";
			Если СтрДлина(Заказчик.u_passport_number)>0 Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+Заказчик.u_passport_number;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_taken)>0 Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+"выдан "+Заказчик.u_passport_taken;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_date)>0 Тогда 				
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;
				Паспорт = Паспорт+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_passport_date);
			КонецЕсли;
			Если СтрДлина(Паспорт)>0 Тогда 
				НайденКонтрагент.ДокументУдостоверяющийЛичность = Паспорт;
			КонецЕсли;
			
			ДатаРождения = "";			
			Если СтрДлина(Заказчик.u_birthday)>0 Тогда 
				ДатаРождения = ДатаРождения+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday);
			КонецЕсли;
			
			НайденКонтрагент.Комментарий = "";
			Если СтрДлина(Паспорт)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+Паспорт; КонецЕсли;
			Если СтрДлина(ДатаРождения)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" д.р. "+ДатаРождения; КонецЕсли;
		КонецЕсли;
		
		
		НайденКонтрагент.ДополнительнаяИнформация = "";
		Если СтрДлина(Заказчик.address)>0 Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Адрес: "+Заказчик.address;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.Представление = СокрЛП(Заказчик.address);				
		КонецЕсли;
		
		Если СтрДлина(Заказчик.u_phone_mobile)>0 ИЛИ СтрДлина(Заказчик.u_phone)>0 Тогда
			Телефоны = Новый Массив(2);
			СчетМассив = 0;
			Если СтрДлина(Заказчик.u_phone_mobile)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone_mobile;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_phone)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone;
			КонецЕсли;				
			Если Телефоны.Количество()>0 Тогда
				Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
				НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Телефоны: "+СокрЛП(СтрСоединить(Телефоны,", "));					
				НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
				НоваяСтрока.Представление = СокрЛП(СтрСоединить(Телефоны,", "));
				НоваяСтрока.НомерТелефона = Телефоны[0];
			КонецЕсли;				
		КонецЕсли;
		
		
		Если СтрДлина(Заказчик.u_email)>0 Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Эл.почта: "+Заказчик.u_email;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.АдресЭП = Заказчик.u_email;
			НоваяСтрока.Представление = СокрЛП(Заказчик.u_email);			
		КонецЕсли;
		КаталогЗаказчиков = ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогЗаказчиков");
		НайденКонтрагент.Родитель = КаталогЗаказчиков;
		НайденКонтрагент.Записать();
	КонецЕсли;
	Возврат НайденКонтрагент;
КонецФункции

//СоздатьДоговорПокупателя(Заявка)
//Получает, а при необходимости создает договор покупателя, на основании присланной заявки СБ
&НаСервере
Функция СоздатьДоговорПокупателя(Заявка)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьДоговорПокупателя(Заявка,Истина);
КонецФункции


//ПолучитьКонтрагентаПоДоговору(Договор)
//возвращает контрагента по договору
&НаСервере
Функция ПолучитьКонтрагентаПоДоговору(Договор)
	Возврат Договор.Владелец;
КонецФункции

//ПолучитьДанныеКлиента(КодКлиента)
//по коду клиента в СБ возвращает структуру данных клиента из СБ
&НаСервере
Функция ПолучитьДанныеКлиента(КодКлиента)
	Возврат ЭТ_ОбщийМодуль2.User(Новый Структура("id",КодКлиента));
КонецФункции

//ПолучитьДанныеЗаявки(СледЗаявкаНомер)
//по присланному коду заявки в СБ возвращает структуру данных заявки из СБ
&НаСервере
Функция ПолучитьДанныеЗаявки(СледЗаявкаНомер)
	Возврат ЭТ_ОбщийМодуль2.Request(Новый Структура("id",СледЗаявкаНомер));
КонецФункции

//ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
//получает настройку пользователя по присланному коду
&НаСервере
Функция ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку(Ключ,ПоУмолчанию);	
КонецФункции

//ПолучитьМассивЗаявок(Параметры)
//на основании присланной структуры параметров СБ, возвращает массив документов с заявками из той же СБ
&НаСервере
Функция ПолучитьМассивЗаявок(Параметры)
	Возврат ЭТ_ОбщийМодуль2.RequestSearch(Параметры);	
КонецФункции

//ЭТ_ЗаполнитьНаОснованииСБВместо(Команда)
//Управляет видимостью панели заполнения на основании из U-ON
&НаКлиенте
Процедура ЭТ_ЗаполнитьНаОснованииСБВместо(Команда)
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = НЕ ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость;
КонецПроцедуры


//ЭТ_ЗаполнитьФорму(Парам)
//на основании присланных параметов, заполняет форму документа
//Использование не нашел - процедура кандидат на удаление (проверить использование в интерфейсе)
//на деле работает процедура ЭТ_ЗаполнитьСБВместо(Команда)
&НаСервере
Процедура ЭТ_ЗаполнитьФорму(Парам)
	Объект.СуммаДокумента = Парам.Парам
КонецПроцедуры

//ПолучитьВариантыНомера(СтрокаПоиска)
//на основании присланной строки поиска, получает возможные варианты номеров заявки
&НаСервере
Функция ПолучитьВариантыНомера(СтрокаПоиска)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьВариантыНомера(СтрокаПоиска);
КонецФункции

Функция ПолучитьИННОрганизации(Организация)
	Возврат Организация.ИНН;
КонецФункции

&НаСервере
Функция ПолучитьЗаявку(НомерЗаявки)
	КВозврату = Новый Структура;
	Префикс = СокрЛП(ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс","ЭТ18-")); 
	СтрокаПоиска = ВРег(СокрЛП(ЭтаФорма.СтрокаПоиска)); 
	Если СтрНайти(СтрокаПоиска,ВРег(Префикс))=0 Тогда
		СтрокаПоиска = Префикс + СтрокаПоиска;
	КонецЕсли;
	НомерЗаявки = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(СтрокаПоиска,Префикс);
	КВозврату = ЭТ_ОбщийМодуль2.ПолучитьЗаявкуПоНомеру(НомерЗаявки);
	Возврат  КВозврату;
КонецФункции


//ЭТ_ЗаполнитьСБВместо(Команда)
//вот наш герой, заполняет форму по клику на кнопку Заполнить из панели "из U-ON"
//нового контрагента не создает, а вот договор за контрагентом, в случае его отсутствия создает
&НаКлиенте
Процедура ЭТ_ЗаполнитьСБВместо(Команда)
	СледЗаявка = ПолучитьЗаявку(ЭтаФорма.СтрокаПоиска);
	Если СледЗаявка.Свойство("id_internal") Тогда
		НайденДоговор = НайтиДоговорПокупателя(СледЗаявка,Ложь);
		Если НЕ НайденДоговор = Ложь Тогда
			Контрагент = ПолучитьКонтрагентаПоДоговору(НайденДоговор);
			РасшифровкаПлатежаДоговорКонтрагента = НайденДоговор;
		Иначе
			СозданДоговор = СоздатьДоговорПокупателя(СледЗаявка);
			Контрагент = ПолучитьКонтрагентаПоДоговору(СозданДоговор);
			РасшифровкаПлатежаДоговорКонтрагента = СозданДоговор;
		КонецЕсли;          
		
		Если СледЗаявка.supplier_inn = ПолучитьИННОрганизации(Объект.Организация) Тогда
			//ОтражениеАванса = "Доход УСН";             
			ОтражениеАванса = ПолучитьНастройку("ОтражениеАвансаПоставщики","Доход УСН"); //"Доход УСН";             
			Сообщить("Наша компания является туроператором");
			//ПоказатьПредупреждение(,"Наша компания является туроператором",,"Предупреждение");
		Иначе
			//ОтражениеАванса = "Доход комитента";
			ОтражениеАванса = ПолучитьНастройку("ОтражениеАвансаАгенты","Доход комитента");
		КонецЕсли;
		
		ЗаполнитьФормуПКО(Новый Структура("Контрагент, РасшифровкаПлатежаДоговорКонтрагента",Контрагент, РасшифровкаПлатежаДоговорКонтрагента));
		РасшифровкаПлатежаОтражениеАвансаПредставление = ОтражениеАванса;
	КонецЕсли;
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = Ложь;
	ТекущийЭлемент = ЭтаФорма.Элементы.СуммаДокумента;
КонецПроцедуры

&НаСервере
Функция ЭтоНовыйОбъект()
	Возврат Объект.Ссылка.Пустая();
КонецФункции

&НаКлиенте
Процедура ЭТ_ПриОткрытииПосле(Отказ)
	Если ЭтоНовыйОбъект() Тогда
		УстановитьбезДоходКомитента();
		РасшифровкаПлатежаОтражениеАвансаПредставлениеПриИзменении(ЭтаФорма.Элементы.РасшифровкаПлатежаОтражениеАвансаПредставление);
		УстановитьбезНДС();
		РасшифровкаПлатежаСтавкаНДСПриИзменении(ЭтаФорма.Элементы.РасшифровкаПлатежаСтавкаНДС);
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура УстановитьбезНДС()
	ЭтотОбъект.РасшифровкаПлатежаСтавкаНДС = Перечисления.СтавкиНДС["БезНДС"];
КонецПроцедуры
	
&НаСервере
Процедура УстановитьбезДоходКомитента()
	ЭтотОбъект.РасшифровкаПлатежаОтражениеАвансаПредставление = Перечисления.ПорядокОтраженияАвансов["ДоходКомитента"];
КонецПроцедуры
	

