Процедура ПередЗаписью(Отказ, Замещение)

	Для Каждого ЗаписьИзНабора Из ЭтотОбъект Цикл    
		
		Если Не ЗначениеЗаполнено(ЗаписьИзНабора.Организация) Тогда
			ЗаписьИзНабора.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗаписьИзНабора.ДоговорПоставщика)
			И ЗначениеЗаполнено(ЗаписьИзНабора.Поставщик) Тогда
			
			ЗаписьИзНабора.ДоговорПоставщика = ПолучитьОсновнойДоговорПоставщика(
				ЗаписьИзНабора.Поставщик,
				ЗаписьИзНабора.Организация
			);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗаписьИзНабора.Поставщик)
			И ЗначениеЗаполнено(ЗаписьИзНабора.ДоговорПоставщика) Тогда
			ЗаписьИзНабора.Поставщик = ЗаписьИзНабора.ДоговорПоставщика.Владелец;
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(ЗаписьИзНабора.Клиент)
			И ЗначениеЗаполнено(ЗаписьИзНабора.ДоговорКлиента) Тогда
			ЗаписьИзНабора.Клиент = ЗаписьИзНабора.ДоговорКлиента.Владелец;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


Функция ПолучитьОсновнойДоговорПоставщика(Поставщик, Организация)
	
	Если Не ЗначениеЗаполнено(Поставщик) Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	МассивВидовДоговоров = Новый Массив;
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СТранспортнойКомпанией);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Возврат РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
		Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),
		Поставщик,
		Организация,
		МассивВидовДоговоров
	);
	
КонецФункции