
&НаСервере
Процедура СохранитьНастройкиНаСервере()
	ЭТ_КомиссииТО.СохранитьНастройку("КомиссияТОПуть",Объект.КомиссияТОПуть);	
	ЭТ_КомиссииТО.СохранитьНастройку("ApiKey",Объект.КомиссияТОКлюч);	
	ЭТ_КомиссииТО.СохранитьНастройку("КомиссияАгент",Объект.КомиссияАгент);	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоискНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)
	ПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначениеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗначение(Команда)
	СохранитьЗначениеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьВсеНастройки()	
	Объект.КомиссияТОПуть = ЭТ_КомиссииТО.ПолучитьНастройку("КомиссияТОПуть");
	Объект.КомиссияТОКлюч = ЭТ_КомиссииТО.ПолучитьНастройку("ApiKey");
	Объект.КомиссияАгент = ЭТ_КомиссииТО.ПолучитьНастройку("КомиссияАгент");
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ПолучитьВсеНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
