
&После("УстановкаПараметровСеанса")
Процедура ЭТ_УстановкаПараметровСеанса(ТребуемыеПараметры)
	КлючОбъекта  = "ЭТ";
   	ИмяПользователя = ИмяПользователя();

	КлючНастроек = "ОрганизацияДопуск";
	Настройки = "6671204589 667351953232";
    ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);
	
	КлючНастроек = "РеализацияПоставщикПоУмолчанию";
	Настройки = Ложь;
    ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);     
	
	
	КлючНастроек = "УведомлятьМенеджераОбОплатеКлиентаНаПочту";
	Настройки = Ложь;
    ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);     
	
	
	Если СтрНайти(нрег(ПользователиКлиентСервер.ТекущийПользователь()),нрег("уралфинанс"))>0 Тогда      
		КлючНастроек = "ВыключитьМодуль";
		Настройки = Истина;
    	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);
		//ЭТ_ОбщийМодуль2.СохранитьНастройку("ВыключитьМодуль", Истина);
	КонецЕсли;           
	
	//исправим ошибку ВидДоговораКлиент
	ВидДогговораКлиент = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, "ВидДогговораКлиент", "", , ИмяПользователя);
	ВидДоговораКлиент = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, "ВидДоговораКлиент", "", , ИмяПользователя);
	Если СтрДлина(СокрЛП(ВидДогговораКлиент))>0 И СтрДлина(СокрЛП(ВидДоговораКлиент))<1 Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта,  "ВидДоговораКлиент", ВидДогговораКлиент, , ИмяПользователя);	
	КонецЕсли;
	
КонецПроцедуры
