
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Параметры.ВыбПериод = ВыбПериод;
КонецПроцедуры

&НаКлиенте
Процедура ОК_форма(Команда)
	ПараметрЗакрытия = новый Структура();
	ПараметрЗакрытия.Вставить("Организация",Организация);
	ПараметрЗакрытия.Вставить("Контрагент",Контрагент);
	ПараметрЗакрытия.Вставить("ВыбПериод",ВыбПериод);
	Закрыть(ПараметрЗакрытия);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)      
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("Контрагент") Тогда
		Контрагент = Параметры.Контрагент;
	КонецЕсли;
	
	Если не(Организация.Пустая()) И не(Контрагент.Пустая()) Тогда
		ДанныеКонтрагента =  РегистрыСведений.ЭТ_КомиссияТО_ПоУмолчанию.ПолучитьКомиссиюТОПоУмолчанию(Организация, Контрагент);
		Если ДанныеКонтрагента.Свойство("ИспользуемыйТипДаты") Тогда
			ТипДаты =  ДанныеКонтрагента.ИспользуемыйТипДаты;
		КонецЕсли;
	КонецЕсли;   
	
	НачалоТекущегоМесяца = НачалоМесяца(ТекущаяДата());
	ВыбПериод.ДатаНачала = НачалоМесяца(НачалоТекущегоМесяца-1);
	ВыбПериод.ДатаОкончания = КонецМесяца(ВыбПериод.ДатаНачала);
	
КонецПроцедуры
