&НаКлиенте
// Функция преобразует ТаблицуЗначений в Массив из структур.
Функция ПреобразоватьТаблицуЗначенийВМассив(тзДанные) Экспорт   
    мсДанные = Новый Массив;
    // Запишем в массив
    Для Каждого СтрокаТЗ Из тзДанные Цикл
        стСтрокаТаблицы = Новый Структура;
        Для Каждого ИмяКолонки Из тзДанные.Колонки Цикл
            стСтрокаТаблицы.Вставить(ИмяКолонки.Имя, СтрокаТЗ[ИмяКолонки.Имя]);
        КонецЦикла;
        мсДанные.Добавить(стСтрокаТаблицы);
    КонецЦикла;
    Возврат мсДанные;
КонецФункции // ПреобразоватьТаблицуЗначенийВМассив()

&НаСервере
// Функция преобразует Массив из структур в ТаблицуЗначений.
Функция ПреобразоватьМассивВТаблицуЗначений(мсДанные) Экспорт    
    тзДанные = Новый ТаблицаЗначений;    
    Для Каждого ЭлементМассива Из мсДанные Цикл
        // Рисуем колонки для таблицы
        Если тзДанные.Колонки.Количество() = 0 Тогда
            Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
                тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
            КонецЦикла;
        КонецЕсли;        
        // Добавляем данные в таблицу
        НоваяСтрока = тзДанные.Добавить();
        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
        КонецЦикла;
    КонецЦикла;    
    Возврат тзДанные;    
КонецФункции // ПреобразоватьМассивВТаблицуЗначений()
