//ЭТ_ОбработкаПроведения(Отказ, Режим)
//При проведении документа, если вид операции ОплатаПокупателя, то добавляем платеж в СБ
&Перед("ОбработкаПроведения")
Процедура ЭТ_ОбработкаПроведения(Отказ, Режим)
	Если Отказ Тогда Возврат; КонецЕсли;    
	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
	Если ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийРКО.ВозвратПокупателю Тогда Возврат; КонецЕсли;	
	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина Тогда Сообщить("Модуль интеграции с U-ON отключен!"); Возврат; КонецЕсли;			
	ОтличноеПроведение = Истина;
	ПараметрыПроведения = Документы.РасходныйКассовыйОрдер.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если ПараметрыПроведения.Свойство("ДокументСсылка") Тогда
		Док = ПараметрыПроведения.ДокументСсылка.ПолучитьОбъект();
		//Если ЭТ_ОбщийМодуль2.РеестрПрохождения(Док.Метаданные().ПолноеИмя() +"."+ Док.Номер,60) Тогда
		Если НЕ ЭТ_ОбщийМодуль2.ДобавитьВозвратКлиенту(ПараметрыПроведения.ДокументСсылка) Тогда
			ОтличноеПроведение = Ложь;
		КонецЕсли;		
		//КонецЕсли;		
	КонецЕсли;
	Если ОтличноеПроведение = Ложь И НЕ ЭТ_ОбщийМодуль2.ПолучитьНастройку("РазрешитьПроведениеБезСБ") Тогда Отказ = Истина;  Сообщить("Не могу выполнить данныю операцию в СБ U-ON"); Возврат; КонецЕсли;
КонецПроцедуры

//ЭТ_ОбработкаУдаленияПроведения(Отказ)
//При отмене проведения удаляем платеж из СБ
&После("ОбработкаУдаленияПроведения")
Процедура ЭТ_ОбработкаУдаленияПроведения(Отказ)
	Если Отказ Тогда Возврат; КонецЕсли;        
	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
	Если ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийРКО.ВозвратПокупателю Тогда Возврат; КонецЕсли;	
	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина Тогда Сообщить("Модуль интеграции с U-ON отключен!"); Возврат; КонецЕсли;		
	ОтличноеПроведение = Истина;
	ПараметрыПроведения = Документы.РасходныйКассовыйОрдер.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если ПараметрыПроведения.Свойство("ДокументСсылка") Тогда
		Если НЕ ЭТ_ОбщийМодуль2.УдалитьВозвратКлиенту(ПараметрыПроведения.ДокументСсылка) Тогда
			ОтличноеПроведение = Ложь;
		КонецЕсли;		
	КонецЕсли;
	Если ОтличноеПроведение = Ложь И НЕ ЭТ_ОбщийМодуль2.ПолучитьНастройку("РазрешитьПроведениеБезСБ") Тогда Отказ = Истина;  Сообщить("Не могу выполнить данныю операцию в СБ U-ON"); Возврат; КонецЕсли;
КонецПроцедуры
