&Вместо("НаименованиеВСтрокеЧека")
Функция ЭТ_НаименованиеВСтрокеЧека(СтруктураШапки) Экспорт
	Если (СтрНайти(
		НРег(СтрЗаменить(СтруктураШапки.Основание," ","")),
		НРег(СтрЗаменить("Оплата по договору"," ",""))
		)>0
		ИЛИ	СтрНайти(
			НРег(СтрЗаменить(СтруктураШапки.Основание," ","")),
			НРег(СтрЗаменить(ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс","")," ",""))
		)>0)
		И СтрДлина(СокрЛП(СтруктураШапки.Основание))>0
	Тогда
		Возврат "За туруслуги по договору " + СтруктураШапки.Ссылка.ДоговорКонтрагента.Номер;	
	Иначе
		 Возврат ПродолжитьВызов(СтруктураШапки); 
	КонецЕсли;
	
КонецФункции
