//ЭТ_ОбработкаПроведения(Отказ, Режим)
//при проведении документа добавляем платеж клиента
//т.к. документ исключительно для ручного проведения, то необходимость контроля двойного платежа отпадает
//при удачном создании платежа клиента, система создает в СБ дополнительно документ СПИСАНИЕ, в котором отображается комиссия банка
//комиссия может быть перенесена как на сторону клиента, так и на нашу сторону (в наши расходы), данный параметр задается в настройках ЭТ
&Перед("ОбработкаПроведения")
Процедура ЭТ_ОбработкаПроведения(Отказ, Режим)
	
	Если Отказ Тогда Возврат; КонецЕсли;
	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
	
	Если (ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя) И (ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю) Тогда Возврат; КонецЕсли;
	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина Тогда Сообщить("Модуль интеграции с U-ON отключен!"); Возврат; КонецЕсли;		
	ОтличноеПроведение = Истина;
	ПараметрыПроведения = Документы.ОплатаПлатежнойКартой.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Док = ПараметрыПроведения.ДокументСсылка.ПолучитьОбъект();
	//Если ЭТ_ОбщийМодуль2.РеестрПрохождения(Док.Метаданные().ПолноеИмя() +"."+ Док.Номер,60) Тогда
	Если ПараметрыПроведения.Свойство("ДокументСсылка") Тогда
		Если ЭтотОбъект.ВидОперации=Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя Тогда
			Если НЕ ЭТ_ОбщийМодуль2.ДобавитьПлатежКлиента(ПараметрыПроведения.ДокументСсылка) Тогда
				ОтличноеПроведение = Ложь;
			Иначе
				ДанныеЭквайринга = ЭТ_ОбщийМодуль2.ОпределитьКассуРасчета(ПараметрыПроведения.ДокументСсылка.ВидОплаты,Новый Структура("КассаЮОН,ПроцентКомиссии,ВРасходы",ЭТ_ОбщийМодуль2.ПолучитьНастройку("КассаКлиентКарта"),ЭТ_ОбщийМодуль2.ПолучитьНастройку("КомиссияБанкаКарта"),0));
				КомиссияБанкаКарта = ДанныеЭквайринга.ПроцентКомиссии;
				ВРасходы = ДанныеЭквайринга.ВРасходы;
				Если НЕ ВРасходы Тогда		
					ДокСписанияКомиссии = ПараметрыПроведения.ДокументСсылка.ПолучитьОбъект();
					//ЭТ_ОбщийМодуль2.УдалитьСписаниеКлиента(ДокСписанияКомиссии);
					ДокСписанияКомиссии.СуммаДокумента = ДокСписанияКомиссии.СуммаДокумента * (КомиссияБанкаКарта/100);
					Если НЕ ЭТ_ОбщийМодуль2.ДобавитьСписаниеКлиента(ДокСписанияКомиссии) Тогда
						Сообщить("Не могу выполнить списание комиссии с заявки!");
					КонецЕсли;
				Иначе
					ДокСписанияКомиссии = ПараметрыПроведения.ДокументСсылка.ПолучитьОбъект();
					//ЭТ_ОбщийМодуль2.УдалитьКомиссиюИзРасходов(ДокСписанияКомиссии);
					ДокСписанияКомиссии.СуммаДокумента = ДокСписанияКомиссии.СуммаДокумента * (КомиссияБанкаКарта/100);
					Если НЕ ЭТ_ОбщийМодуль2.ДобавитьКомиссиюВРасходы(ДокСписанияКомиссии) Тогда
						Сообщить("Не могу выполнить операцию расхода, для  комиссии с заявки!");
					КонецЕсли;
				КонецЕсли;			
			КонецЕсли;		
		ИначеЕсли ЭтотОбъект.ВидОперации=Перечисления.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю Тогда
			Если НЕ ЭТ_ОбщийМодуль2.ДобавитьВозвратКлиенту(ПараметрыПроведения.ДокументСсылка) Тогда
				ОтличноеПроведение = Ложь;
			КонецЕсли;
		КонецЕсли;
			
		
		
	КонецЕсли;
	Если ОтличноеПроведение = Ложь И НЕ ЭТ_ОбщийМодуль2.ПолучитьНастройку("РазрешитьПроведениеБезСБ") Тогда Отказ = Истина;  Сообщить("Не могу выполнить данныю операцию в СБ U-ON"); Возврат; КонецЕсли;
	//КонецЕсли;	
КонецПроцедуры

//ЭТ_ОбработкаУдаленияПроведения(Отказ)
//при отмене проведения удаляет платеж в СБ, так же пытается найти комиссию и так же удаляет данный документ
&После("ОбработкаУдаленияПроведения")
Процедура ЭТ_ОбработкаУдаленияПроведения(Отказ)
	Если Отказ Тогда Возврат; КонецЕсли;
	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
	Если (ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя) И ((ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю)) Тогда Возврат; КонецЕсли;		
	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина Тогда Сообщить("Модуль интеграции с U-ON отключен!"); Возврат; КонецЕсли;		

	ОтличноеПроведение = Истина;
	ПараметрыПроведения = Документы.ОплатаПлатежнойКартой.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если ПараметрыПроведения.Свойство("ДокументСсылка") Тогда
		
		
		Если ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя Тогда
			Если НЕ ЭТ_ОбщийМодуль2.УдалитьПлатежКлиента(ПараметрыПроведения.ДокументСсылка) Тогда
				ОтличноеПроведение = Ложь;
			Иначе			
				КомиссияБанкаКарта = ЭТ_ОбщийМодуль2.ПолучитьНастройку("КомиссияБанкаКарта");
				ДокСписанияКомиссии = ПараметрыПроведения.ДокументСсылка.ПолучитьОбъект();
				ДокСписанияКомиссии.СуммаДокумента = ДокСписанияКомиссии.СуммаДокумента * (КомиссияБанкаКарта/100);
				Если НЕ ЭТ_ОбщийМодуль2.УдалитьСписаниеКлиента(ДокСписанияКомиссии) Тогда
					Сообщить("Не могу выполнить удаление списания комиссии с заявки!");
				КонецЕсли;	
				ДанныеЭквайринга = ЭТ_ОбщийМодуль2.ОпределитьКассуРасчета(ПараметрыПроведения.ДокументСсылка.ВидОплаты,Новый Структура("КассаЮОН,ПроцентКомиссии,ВРасходы",ЭТ_ОбщийМодуль2.ПолучитьНастройку("КассаКлиентКарта"),ЭТ_ОбщийМодуль2.ПолучитьНастройку("КомиссияБанкаКарта"),0));
				КомиссияБанкаКарта = ДанныеЭквайринга.ПроцентКомиссии;
				ВРасходы = ДанныеЭквайринга.ВРасходы;
				Если НЕ ВРасходы Тогда			
						Сообщить("Не могу удалить списание комиссии с заявки!");
				Иначе
					ДокСписанияКомиссии = ПараметрыПроведения.ДокументСсылка.ПолучитьОбъект();
					ЭТ_ОбщийМодуль2.УдалитьКомиссиюИзРасходов(ДокСписанияКомиссии);
				КонецЕсли;			
				
			КонецЕсли;
		ИначеЕсли (ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю) Тогда
			Если НЕ ЭТ_ОбщийМодуль2.УдалитьВозвратКлиенту(ПараметрыПроведения.ДокументСсылка) Тогда
				ОтличноеПроведение = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ОтличноеПроведение = Ложь И НЕ ЭТ_ОбщийМодуль2.ПолучитьНастройку("РазрешитьПроведениеБезСБ") Тогда Отказ = Истина;  Сообщить("Не могу выполнить данныю операцию в СБ U-ON"); Возврат; КонецЕсли;
КонецПроцедуры
