//&НаКлиенте
//Перем ТекущаяСтрока;

//&НаКлиенте
//Процедура ЭТ_ДокументыКИмпортуПриАктивизацииСтрокиПосле(Элемент)
//	Если ТекущаяСтрока = Элементы.ДокументыКИмпорту.ТекущаяСтрока Тогда
//	    Возврат;
//	КонецЕсли;
//	ТекущаяСтрока = Элементы.ДокументыКИмпорту.ТекущаяСтрока;
//   	Если ТекущаяСтрока = Неопределено Тогда
//        Возврат;
//    КонецЕсли;
//	
//	//ЭТ_ДобавитьПунктыВМенюСписка(ТекущаяСтрока);
//	
//КонецПроцедуры                                


//&НаСервере
//Процедура ЭТ_ДобавитьПунктыВМенюСписка(СтрокаТаблицы)
//	//Префикс = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс","ЭТ18-");
//	//НомерЗаявкиИзОснования = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(ДокументыКИмпорту[СтрокаТаблицы].НазначениеПлатежа,Префикс);
//	//	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//	//// Данный фрагмент построен конструктором.
//	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
//	//
//	//Запрос = Новый Запрос;
//	//Запрос.Текст = 
//	//	"ВЫБРАТЬ
//	//	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
//	//	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
//	//	|	ДоговорыКонтрагентов.Дата КАК Дата,
//	//	|	ДоговорыКонтрагентов.Номер КАК Номер,
//	//	|	ДоговорыКонтрагентов.Владелец КАК Владелец
//	//	|ИЗ
//	//	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//	//	|ГДЕ
//	//	|	ДоговорыКонтрагентов.Номер ПОДОБНО &Номер
//	//	|	И ДоговорыКонтрагентов.ПометкаУдаления = Значение(Ложь)
//	//	|
//	//	|УПОРЯДОЧИТЬ ПО
//	//	|	Дата УБЫВ";
//	//
//	//РезультатЗапроса = Запрос.Выполнить();
//	//
//	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	//
//	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
//	//КонецЦикла;
//	//
//	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

//	////ПолучитьКодИзСтроки	

//КонецПроцедуры


//// Процедура - Выбор договора
////
//// Параметры:
////  Команда	 - 	 - 
////
//&НаКлиенте
//Процедура ВыборДоговора(Команда)
//   	ДополнительныеПараметры = Новый Структура(
//		"Основание,Контрагент,СчетКонтрагента,Договор,СуммаСписано,СуммаПоступило"
//		,ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].НазначениеПлатежа
//		,ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].Контрагент
//		,ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].СчетКонтрагента
//		,ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].Договор
//		,ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].СуммаСписано
//		,ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].СуммаПоступило
//	);                                                                                  
//	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьРезультатМастера",ЭтаФорма);
//	
//	ОткрытьФорму("ОбщаяФорма.ЭТ_ВыборДоговораЗагрузкаБанка",ДополнительныеПараметры,,,,,ОписаниеВыбора);
//	//ПолучитьФорму("ОбщаяФорма.ЭТ_ВыборДоговораЗагрузкаБанка",ДополнительныеПараметры);
//	//Форма.Открыть();				
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработатьРезультатМастера(ЗначениеВыбора,Параметр) Экспорт
//	Если ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].Контрагент <> ПолучитьКонтрагентаПоДоговору(ЗначениеВыбора.Договор) Тогда		
//		ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВопросСменыКонтрагента",ЭтаФорма,ЗначениеВыбора);
//		ПоказатьВопрос(ОписаниеВыбора,"Контрагент выбранного договора не совпадает с контрагентом в платежном поручении.",РежимДиалогаВопрос.ДаНет,,,"Поменять контрагента в операции платежа ?");
//	Иначе
//		ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].Договор = ЗначениеВыбора.Договор;
//	КонецЕсли;
//КонецПроцедуры


//&НаКлиенте
//Процедура ОбработатьВопросСменыКонтрагента(ЗначениеВыбора,Параметр) Экспорт
//	Если ЗначениеВыбора=КодВозвратаДиалога.Да Тогда
//		ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].Контрагент = ПолучитьКонтрагентаПоДоговору(Параметр.Договор);
//		ДокументыКИмпорту[Элементы.ДокументыКИмпорту.ТекущаяСтрока].Договор = Параметр.Договор;		
//	КонецЕсли;	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьКонтрагентаПоДоговору(ДоговорСсылка)
//	Возврат ДоговорСсылка.Владелец;
//КонецФункции

//&НаСервере
//Процедура ЭТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//	//Элементы.ДокументыКИмпорту.УстановитьВыполнениеПослеОбработчиковСобытия("ПриАктивизацииСтроки","ЭТ_ДокументыКИмпортуПриАктивизацииСтрокиПосле");
//	//Элементы.ДокументыКИмпорту.УстановитьДействие("ПриАктивизацииСтроки","ЭТ_ДокументыКИмпортуПриАктивизацииСтрокиПосле");
//	Команда = ЭтаФорма.Команды.Добавить("ВыборДоговора");
//	Команда.Действие = "ВыборДоговора";
//	НовЭлемент = Элементы.Добавить("Пункт", Тип("КнопкаФормы"), Элементы.ДокументыКИмпортуКонтекстноеМеню);
//	НовЭлемент.ИмяКоманды = "ВыборДоговора";                                                              
//	НовЭлемент.Заголовок = "Определить договор";
//КонецПроцедуры
