// ===== Низкоуровневые функции API интерфейса
&НаСервере
Функция ПолучитьСоединениеСБ() Экспорт
	Возврат Новый HTTPСоединение(
	    "api.u-on.ru", // сервер (хост)
	    443, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    10, // таймаут в секундах, 0 или пусто - не устанавливать
	    Новый ЗащищенноеСоединениеOpenSSL()  // защищенное соединение, если используется https
	);
КонецФункции

&НаСервере
Функция ОпроавитьПостЗапрос(Адрес,СтруктураПараметров) Экспорт
	АПИ = ПолучитьНастройку("ApiKey");	
	Соединение = ПолучитьСоединениеСБ(); // Подключаемся к сайту.
	Запрос = Новый HTTPЗапрос(Адрес+".json");
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СтруктураПараметров.Вставить("ApiKey",АПИ);
	ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);	
	СтрJSON = ЗаписьJSON.Закрыть();
	Запрос.Заголовки.Вставить("Content-type", "application/json");
	Запрос.УстановитьТелоИзСтроки(СтрJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);	
	Код = 0;
	Результат = Соединение.ОтправитьДляОбработки(Запрос);
	Если Результат.КодСостояния>100 и Результат.КодСостояния<300 Тогда
		ЧтениеДСОН = Новый ЧтениеJSON;
		ЧтениеДСОН.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
		МассивДанных = ПрочитатьJSON(ЧтениеДСОН);
		Если МассивДанных.Свойство("id") Тогда
			Код = Число(МассивДанных.id);
		Иначе
			Код = МассивДанных;
		КонецЕсли;
		ЧтениеДСОН.Закрыть();
	Иначе
		Сообщить("ОШИБКА [ОпроавитьДЖСОНЗапрос]: "+строка(Результат.КодСостояния)+". Во время получения данных возникла ошибка. Проверьте исходные параметры.",СтатусСообщения.Внимание);
	КонецЕсли;
	Возврат Код;
КонецФункции

&НаСервере
//переделать параметры
Функция ОпроавитьГетЗапрос(Адрес,ПеременнаяРезультата="") Экспорт
	КВозврату = Ложь;
    Соединение = ПолучитьСоединениеСБ();
	АПИ = ПолучитьНастройку("ApiKey");
    Запрос = Новый HTTPЗапрос(Адрес+".php");
	Результат = Соединение.Получить(Запрос);	
	Если Результат.КодСостояния>100 и Результат.КодСостояния<300 Тогда
		ЧтениеДСОН = Новый ЧтениеJSON;
		ЧтениеДСОН.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
		МассивДанных = ПрочитатьJSON(ЧтениеДСОН);
		Если СтрДлина(СокрЛП(ПеременнаяРезультата))<1 Тогда
			КВозврату = МассивДанных;	
		ИначеЕсли МассивДанных.Свойство(ПеременнаяРезультата) Тогда
			Если МассивДанных[ПеременнаяРезультата].Количество()>0 Тогда
				КВозврату=МассивДанных[ПеременнаяРезультата];
			КонецЕсли;
		Иначе
			КВозврату = Ложь;			
		КонецЕсли;		
		ЧтениеДСОН.Закрыть();
	Иначе
		Сообщить("ОШИБКА [ОпроавитьГетЗапрос]: "+строка(Результат.КодСостояния)+". Во время получения данных возникла ошибка. Проверьте исходные параметры.",СтатусСообщения.Внимание);
		КВозврату = Ложь;			
	КонецЕсли;
	Возврат КВозврату;	
КонецФункции


// ===== Работа с настройками
&НаСервере
Процедура СохранитьНастройку(КлючНастроек,Настройки) Экспорт
	КлючОбъекта  = "ЭТКомиссии";
    ИмяПользователя = ИмяПользователя();
    ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройку(КлючНастроек,ПоУмолчанию=Неопределено) Экспорт
	КлючОбъекта  = "ЭТКомиссии";
    ИмяПользователя = ИмяПользователя();
	Настройки = ПоУмолчанию;
    Попытка
        Настройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек,,ИмяПользователя);
    Исключение
        Настройки = ПоУмолчанию;
	КонецПопытки;
	
	Если Настройки = Неопределено Тогда
		Настройки = ПоУмолчанию;
	КонецЕсли;
	Возврат Настройки;
КонецФункции

&НаСервере
Функция ПолучитьВсеНастройки() Экспорт
 	//Отбор = Новый Структура("Пользователь, КлючОбъекта, КлючНастроек ", ) 
 	//ВыборкаХранилища = ХранилищеОбщихНастроек.Выбрать(Отбор);
	СпВыгрузки = Новый ТаблицаЗначений;
	СпВыгрузки.Колонки.Добавить("Ключ");
	СпВыгрузки.Колонки.Добавить("Значение");
 	ВыборкаХранилища = ХранилищеОбщихНастроек.Выбрать();
	Пока ВыборкаХранилища.Следующий() Цикл
		Если (СтрНайти(ВыборкаХранилища.КлючОбъекта,"ЭТКомиссии")>0) И (
			НЕ ТипЗнч(ВыборкаХранилища.Настройки) = Тип("Строка")
			) Тогда
			Сообщить("["+ВыборкаХранилища.КлючНастроек+"] ["+ВыборкаХранилища.Настройки+"] ["+ТипЗнч(ВыборкаХранилища.Настройки)+"]");
			//СпВыгрузки.Добавить(ВыборкаХранилища.КлючНастроек,ВыборкаХранилища.Настройки);
			НоваяСтрока = СпВыгрузки.Добавить();
			НоваяСтрока.Ключ = ВыборкаХранилища.КлючНастроек;
			НоваяСтрока.Значение = ВыборкаХранилища.Настройки;
		КонецЕсли;
	КонецЦикла; 	
	Возврат СпВыгрузки;
КонецФункции

