		   
&Перед("ОбработкаПроверкиЗаполнения")
Процедура ЭТ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Сч=0;
	Для Каждого СледПлатеж Из ЭтотОбъект.РасшифровкаПлатежа Цикл
		Если ЭтотОбъект.РасшифровкаПлатежа[Сч].КурсВзаиморасчетов = 0 Тогда       
			ЭтотОбъект.РасшифровкаПлатежа[Сч].КурсВзаиморасчетов = 1;
		КонецЕсли;			
		Сч=Сч+1;
	КонецЦикла;	
КонецПроцедуры


//ЭТ_ОбработкаПроведенияПеред(Отказ, Режим)
//В Конфигурации Бухгалтерия предприятия, редакция 3.0 (3.0.65.72) имеется ошибка, конфигурация не слушается правил, установленных на папку контрагентов в разделе "Счета расчетов контрагентов"
//25.09.2018 на линию поддержки ЭРИКОС была поставлена соответствующая заявка, сам факт наличия ошибки обозначен и подтвержден сотрудниками ЭРИКОС, по их словам в головной офис сделан запрос, с нашей стороны дальнейший контроль только в обновлениях
//пока для решения данной задачи, написан данный блок, все рачсеты с контрагентами из заданной папки ЭЛИТА Трэвэл => Настройки => Туроператоры => Каталог партнеров, приобретают счет расчетов 76.09
&Перед("ОбработкаПроведения")
Процедура ЭТ_ОбработкаПроведенияПеред(Отказ, Режим)
	//Если Отказ Тогда Возврат; КонецЕсли;
	//Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
	//Если (ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина) Тогда Сообщить("Документ не проведен в U-ON!"); Возврат; КонецЕсли;
	//СчетТО=Ложь;
	//Если ЭтотОбъект.РасшифровкаПлатежа.Количество()>0 Тогда
	//	Если ЭтотОбъект.Контрагент.Родитель =   ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогПартнеров")
	//	Тогда
	//		Если ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом <>ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05")
	//			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам <> ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05")
	//		Тогда
	//			ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05");
	//			ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05");
	//			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	//		КонецЕсли;
	//	ИначеЕсли ЭтотОбъект.Контрагент.Родитель =   ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогПоставщиков")
	//	Тогда
	//		Если ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом <>ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01")
	//			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам <> ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.02")
	//		Тогда
	//			ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01");
	//			ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.02");
	//			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;	
КонецПроцедуры

//ЭТ_ОбработкаПроведения(Отказ, Режим)	
//Если счет расчетов 76.09, то добавляем платеж в СБ
&После("ОбработкаПроведения")
Процедура ЭТ_ОбработкаПроведения(Отказ, Режим)	
	Если Отказ Тогда Возврат; КонецЕсли;
	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
	Если (ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина) Тогда Сообщить("Документ не проведен в U-ON!"); Возврат; КонецЕсли;
	МассивПапок = Новый Массив;
	МассивПапок.Добавить(ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогПартнеров"));
	МассивПапок.Добавить(ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогПоставщиков"));	
	Если МассивПапок.Найти(ЭтотОбъект.Контрагент.Родитель) = Неопределено Тогда Возврат; КонецЕсли;
		
	ПараметрыПроведения = Документы.СписаниеСРасчетногоСчета.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Док = ПараметрыПроведения.ДокументСсылка.ПолучитьОбъект();
	//Если НЕ ЭТ_ОбщийМодуль2.РеестрПрохождения(Док.Метаданные().ПолноеИмя() +"."+ Док.Номер,60) Тогда Возврат;	КонецЕсли;
	ОтличноеПроведение = Истина;
	Если ЭтотОбъект.РасшифровкаПлатежа.Количество()>0 Тогда
		Если ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01.1")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01.2")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.02")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.02.1")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.02.2")
		Тогда
			Если (ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику) Тогда
				Если НЕ ЭТ_ОбщийМодуль2.ДобавитьПлатежТО(ЭтотОбъект.Ссылка) Тогда ОтличноеПроведение = Ложь; КонецЕсли;	
			КонецЕсли;
		ИначеЕсли (ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01") 
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01.1") 
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01.2") 
			)
			И (ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02.1")
			ИЛИ ЭтотОбъект.РасшифровкаПлатежа[0].СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02.2")			
			) Тогда
				Если НЕ ЭТ_ОбщийМодуль2.ДобавитьВозвратКлиенту(ЭтотОбъект.Ссылка) Тогда ОтличноеПроведение = Ложь; КонецЕсли;	

			
		КонецЕсли;
	КонецЕсли;
	//Если (НЕ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику) ИЛИ (НЕ СчетТО) Тогда Возврат; КонецЕсли;
	
	
	
	
	Если ОтличноеПроведение = Ложь И НЕ ЭТ_ОбщийМодуль2.ПолучитьНастройку("РазрешитьПроведениеБезСБ") Тогда Отказ = Истина;  Сообщить("Не могу выполнить данныю операцию в СБ U-ON"); Возврат; КонецЕсли;
	Если НЕ ((ЭтотОбъект.СтатьяДвиженияДенежныхСредств = ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредствКлиент")) И (ЭтотОбъект.СтатьяДвиженияДенежныхСредств = ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредств"))) тогда
		Возврат;	
	КонецЕсли;	
КонецПроцедуры

//ЭТ_ОбработкаУдаленияПроведения(Отказ)
//При отмене проведения, если вид операции ОплатаПоставщику, то пытаемся найти и удалить данный платеж из СБ
&После("ОбработкаУдаленияПроведения")
Процедура ЭТ_ОбработкаУдаленияПроведения(Отказ)
	Если Отказ Тогда Возврат; КонецЕсли;
	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина Тогда Сообщить("Модуль интеграции с U-ON отключен!"); Возврат; КонецЕсли;		
	ОтличноеПроведение = Истина;
	ПараметрыПроведения = Документы.СписаниеСРасчетногоСчета.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если ПараметрыПроведения.Свойство("ДокументСсылка") Тогда
		Если ЭтотОбъект.ВидОперации=Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
			Если НЕ ЭТ_ОбщийМодуль2.УдалитьПлатежТО(ЭтотОбъект.Ссылка) Тогда
				ОтличноеПроведение = Ложь;
			КонецЕсли;		
		ИначеЕсли ЭтотОбъект.ВидОперации=Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
			Если НЕ ЭТ_ОбщийМодуль2.УдалитьВозвратКлиенту(ЭтотОбъект.Ссылка) Тогда
				ОтличноеПроведение = Ложь;
			КонецЕсли;					
		КонецЕсли;	
	КонецЕсли;
	//Если ОтличноеПроведение = Ложь И НЕ ЭТ_ОбщийМодуль2.ПолучитьНастройку("РазрешитьПроведениеБезСБ") Тогда Отказ = Истина; Сообщить("Не могу выполнить данныю операцию в СБ U-ON"); Возврат; КонецЕсли;
	Если ОтличноеПроведение = Ложь Тогда Сообщить("Не могу выполнить данныю операцию в СБ U-ON"); КонецЕсли;
КонецПроцедуры