//ЭТ_ОбработкаПроведения(Отказ, РежимПроведения)
//При проведении РеализацияТоваровИУслуг двигаем нужные регистры, создаем комментарии, в общем отображаем операцию в книге учета доходов и расходов
&После("ОбработкаПроведения")
Процедура ЭТ_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
//Выберем всех регистраторов регистра
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
        | КнигаУчетаДоходовИРасходов.Регистратор,
        | КнигаУчетаДоходовИРасходов.Содержание
        |ИЗ
        | РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов
		|ГДЕ
		|	КнигаУчетаДоходовИРасходов.Регистратор = &Регистратор
		|";
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);	
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    //Обойдем регистраторов
    Пока Выборка.Следующий() Цикл
        //Для каждого регистратора выполним изменение набора записей
		НаборЗаписей = РегистрыНакопления.КнигаУчетаДоходовИРасходов.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
		НаборЗаписей.Прочитать();
		Для каждого Запись Из НаборЗаписей Цикл
		    Запись.Содержание = СтрЗаменить(Запись.Содержание,"Аванс","Вознаграждение");
		    Запись.Содержание = СтрЗаменить(Запись.Содержание,ЭТ_ОбщийМодуль2.НайтиМежду(Запись.Содержание,"Оказаны услуги покупателю","по договору"),"Оказаны услуги по договору");
		    Запись.Содержание = СтрЗаменить(Запись.Содержание,ЭТ_ОбщийМодуль2.НайтиПоШаблону(Запись.Содержание,"от 11.11.1111","",1),"");
		    Запись.Содержание = СтрЗаменить(Запись.Содержание,ЭТ_ОбщийМодуль2.НайтиМежду(Запись.Содержание,"Вознаграждение на сумму","отнесен к доходам УСН."),"");
			Пока Найти(Запись.Содержание,"  ")>0 Цикл Запись.Содержание = СтрЗаменить(Запись.Содержание,"  "," ");	КонецЦикла;
			Запись.Содержание = СокрЛП(Запись.Содержание);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина Тогда Сообщить("Модуль интеграции с U-ON отключен!"); Возврат; КонецЕсли;
	Если 
		ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Ложь 
		И  ЭТ_ОбщийМодуль2.ПолучитьНастройку("РеализацияЗакрываетЗаявку",Ложь) = Истина  
	Тогда
		НомерСтрока = СокрЛП(ЭтотОбъект.ДоговорКонтрагента.Номер);
		ЭТ_ОбщийМодуль2.ЗакрытьЗаявку(НомерСтрока);
	КонецЕсли;
	
	//ПоправитьПроводку();
КонецПроцедуры



//Процедура ПоправитьПроводку()
//	
//	//ЭТ_ОбщийМодуль2.СохранитьНастройку("мдАлгоритмПроведения_РеализацияТоваровУслуг",Значение);
//	//Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("РеализацияВсеВАгентскиеУслуги",Ложь) Тогда
//	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("мдАлгоритмПроведения_РеализацияТоваровУслуг",0)=1 Тогда
// 		НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
//    	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
//		НаборЗаписей.Прочитать();
//		
//		Для Каждого Строка Из НаборЗаписей Цикл 
//			Если ЗначениеЗаполнено(Строка.СубконтоКт.ДокументыРасчетовСКонтрагентами) Тогда
//				Если Строка.СубконтоКт.ДокументыРасчетовСКонтрагентами.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.Получить(0) Тогда
//					Строка.Сумма = Число(ЭТ_ОбщийМодуль2.ПолучитьСуммуКомиссииТО(Строка.СубконтоКт.Договоры));
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;	
//		НаборЗаписей.Записать(Истина);
//		//НаборЗаписей.ОбменДанными.Загрузка = Истина;
//		//НаборЗаписей.
//		//НоваяЗапись = НаборЗаписей.Добавить();
//		//НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка;
//		//НоваяЗапись.Организация = ЭтотОбъект.Организация;
//		//НоваяЗапись.Период = ЭтотОбъект.Дата;
//		//НоваяЗапись.ПодразделениеКт =  ЭтотОбъект.Ссылка;
//		//НоваяЗапись.Содержание = "Зачет аванса комитенту (принципалу)";
//		//НоваяЗапись.СубконтоДт.Контрагенты = СледДоговор.Контрагент;
//		//НоваяЗапись.СубконтоДт.Договоры = СледДоговор.ДоговорКонтрагента;
//		//НоваяЗапись.СубконтоДт.ДокументыРасчетовСКонтрагентами = ЭтотОбъект.Ссылка;
//		//НоваяЗапись.СубконтоКт.Контрагенты = СледДоговор.Контрагент;
//		//НоваяЗапись.СубконтоКт.Договоры = СледДоговор.ДоговорКонтрагента;
//		//НоваяЗапись.СубконтоКт.ДокументыРасчетовСКонтрагентами = ОтчетСсылка; //НовыйОтчет.Ссылка;
//		//НоваяЗапись.Сумма = СледДоговор.ДоговорКонтрагента.КомиссияТО;
//		//НоваяЗапись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09"); 
//		//НоваяЗапись.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09"); 		
//		//НаборЗаписей.Записать();
//	КонецЕсли;
//	
//// этот приём используется, если не требуется изменять
//    // найденные проводки
// 
//    // прочитаем проводкипо регистру "Хозрасчетный" запросом
// 
// //   Запрос = Новый Запрос;
// //   Запрос.Текст = 
// //       "ВЫБРАТЬ
// //       |   Хозрасчетный.СчетДт,
// //       |   Хозрасчетный.СубконтоДт1,
// //       |   Хозрасчетный.СубконтоДт2,
// //       |   Хозрасчетный.СчетКт,
// //       |   Хозрасчетный.СубконтоКт1,
// //       |   Хозрасчетный.СубконтоКт2,
// //       |   Хозрасчетный.Сумма
// //       |ИЗ
// //       |   РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК Хозрасчетный
// //       |ГДЕ
// //       |   Хозрасчетный.Регистратор = &ВыбРегистратор
// //       |
// //       |УПОРЯДОЧИТЬ ПО
// //       |   Хозрасчетный.НомерСтроки";
// //
// //   Запрос.УстановитьПараметр("ВыбРегистратор", ЭтотОбъект.Ссылка); 
// //   РезультатЗапроса = Запрос.Выполнить();
// //   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
// //
// //   РеализацияСчетРасчетовТО = ЭТ_ОбщийМодуль2.ПолучитьНастройку("РеализацияСчетРасчетовТО");
// //   ВидДоговораТО = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораТО");
// //   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
// //   	Если 
// //   		РеализацияСчетРасчетовТО = ВыборкаДетальныеЗаписи.СчетДт 
// //   		И РеализацияСчетРасчетовТО = ВыборкаДетальныеЗаписи.СчетКт
// //   		И ВидДоговораТО = ВыборкаДетальныеЗаписи.СубконтоДт2.ВидДоговора
// //   		И ВидДоговораТО = ВыборкаДетальныеЗаписи.СубконтоКт2.ВидДоговора
// //   	Тогда
// //   		Сообщить(
// //               "Дт " + ВыборкаДетальныеЗаписи.СчетДт +
// //               " скДт1 " + ВыборкаДетальныеЗаписи.СубконтоДт1 +
// //               " скДт2 " + ВыборкаДетальныеЗаписи.СубконтоДт2 +
// //               " Кт " + ВыборкаДетальныеЗаписи.СчетКт + 
// //               " скКт1 " + ВыборкаДетальныеЗаписи.СубконтоКт1 +
// //               " скКт2 " + ВыборкаДетальныеЗаписи.СубконтоКт2 +
// //               " " + ВыборкаДетальныеЗаписи.Сумма + " руб."
// //       	);
// //   	КонецЕсли;
// //   КонецЦикла;	
//КонецПроцедуры                  

//Процедура ПровестиОтчетВРегистре()		
//	//ОтчетСсылка=Новый("Отчет
//	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("РеализацияВсеВАгентскиеУслуги",Ложь) Тогда
// 		НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
//    	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
//		НаборЗаписей.Прочитать();
//		НаборЗаписей.ОбменДанными.Загрузка = Истина;
//		НоваяЗапись = НаборЗаписей.Добавить();
//		НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка;
//		НоваяЗапись.Организация = ЭтотОбъект.Организация;
//		НоваяЗапись.Период = ЭтотОбъект.Дата;
//		НоваяЗапись.ПодразделениеКт =  ЭтотОбъект.Ссылка;
//		НоваяЗапись.Содержание = "Зачет аванса комитенту (принципалу)";
//		НоваяЗапись.СубконтоДт.Контрагенты = СледДоговор.Контрагент;
//		НоваяЗапись.СубконтоДт.Договоры = СледДоговор.ДоговорКонтрагента;
//		НоваяЗапись.СубконтоДт.ДокументыРасчетовСКонтрагентами = ЭтотОбъект.Ссылка;
//		НоваяЗапись.СубконтоКт.Контрагенты = СледДоговор.Контрагент;
//		НоваяЗапись.СубконтоКт.Договоры = СледДоговор.ДоговорКонтрагента;
//		НоваяЗапись.СубконтоКт.ДокументыРасчетовСКонтрагентами = ОтчетСсылка; //НовыйОтчет.Ссылка;
//		НоваяЗапись.Сумма = СледДоговор.ДоговорКонтрагента.КомиссияТО;
//		НоваяЗапись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09"); 
//		НоваяЗапись.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09"); 		
//		НаборЗаписей.Записать();
//	КонецЕсли;
//КонецПроцедуры;
	
	
