
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ВыбранныйВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Услуги");
	ЗначенияЗаполнения = Новый Структура();
    ЗначенияЗаполнения.Вставить("ВидОперации", ВыбранныйВидОперации);
    ЗначенияЗаполнения.Вставить("Основание", ПараметрКоманды);
	Оповещение = Новый ОписаниеОповещения("СоздатьПоступлениеТоваровУслугЗавершение", ЭтотОбъект);	
	
	Форма = ПолучитьФорму("ОбщаяФорма.ЭТ_ВыборДоговора",ЗначенияЗаполнения);
    Форма.Открыть();
	//ДанныеФормыДоговора = ОткрытьФорму("ОбщаяФорма.ЭТ_ВыборДоговора",ЗначенияЗаполнения);	
КонецПроцедуры




&НаКлиенте
Процедура СоздатьПоступлениеТоваровУслугЗавершение(Результат, ДополнительныеПараметры) Экспорт
    ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаУслуги", Результат);
КонецПроцедуры
