
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)       
	ЭтотОбъект.ЭТ_КомиссияТО_Организация = Параметры.Организация;
	ЭтотОбъект.ЭТ_КомиссияТО_Контрагент = Параметры.Контрагент;
	Если ЭтотОбъект.ЭТ_КомиссияТО_Организация.Пустая() Тогда
		ЭтотОбъект.ЭТ_КомиссияТО_Организация =	Пользователи.ТекущийПользователь().Подразделение.Владелец;
	КонецЕсли;	
	Комиссия = РегистрыСведений.ЭТ_КомиссияТО_ПоУмолчанию.ПолучитьКомиссиюТОПоУмолчанию(ЭтотОбъект.ЭТ_КомиссияТО_Организация,ЭтотОбъект.ЭТ_КомиссияТО_Контрагент);
	ЭтотОбъект.ЭТ_КомиссияТО_МетодРасчета = Комиссия.МетодРасчета;
	ЭтотОбъект.ЭТ_КомиссияТО_Процент = Комиссия.Процент;
	ЭтотОбъект.ЭТ_КомиссияТО_Фиксированная = Комиссия.Фиксированная;     
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	НоваяЗапись = РегистрыСведений.ЭТ_КомиссияТО_ПоУмолчанию.СоздатьМенеджерЗаписи();
	НоваяЗапись.Организация = ЭтотОбъект.ЭТ_КомиссияТО_Организация;
	НоваяЗапись.Контрагент = ЭтотОбъект.ЭТ_КомиссияТО_Контрагент;
	НоваяЗапись.МетодРасчета = ЭтотОбъект.ЭТ_КомиссияТО_МетодРасчета;    
	НоваяЗапись.Процент = ЭтотОбъект.ЭТ_КомиссияТО_Процент;
	НоваяЗапись.Фиксированная = ЭтотОбъект.ЭТ_КомиссияТО_Фиксированная;  
	НоваяЗапись.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры
