&НаСервере
Функция ПолучитьНастройку(Ключ,Поумолчанию)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку(Ключ,Поумолчанию);
КонецФункции

&НаСервере
Процедура УдалитьНастройку(Ключ)
	ЭТ_ОбщийМодуль2.УдалитьНастройку(Ключ);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЧек()
	ОбновитьПредставлениеЧека();
КонецПроцедуры


&НаКлиенте
&После("ПриОткрытииПосле")
Процедура ЭТ_ПриОткрытииПосле(Отказ)
	ЗначАгента = ПолучитьНастройку("ПечатьЧека_ПриСозданииНаСервере",Ложь);
	Если НЕ ЗначАгента = Ложь Тогда
		СписокСчетчик = Новый СписокЗначений;
		Для Каждого СледТовар Из ПараметрыОперацииФискализацииЧека.ПозицииЧека Цикл
			Если СписокСчетчик.НайтиПоЗначению(СледТовар.ДанныеПоставщика)=Неопределено Тогда
				СписокСчетчик.Добавить(СледТовар.ДанныеПоставщика);
			КонецЕсли;
			СледТовар.ПризнакАгентаПоПредметуРасчета = ЗначАгента;
		КонецЦикла;
		Если СписокСчетчик.Количество()=1 Тогда
			ПризнакАгента = ЗначАгента;
			ПризнакАгентаСтрокой = ЗначАгента;
			ПараметрыОперацииФискализацииЧека.ПризнакАгента = ЗначАгента;
			ПараметрыОперацииФискализацииЧека.ДанныеПоставщика = СписокСчетчик[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	
	//ЭтаФорма.Элементы.ТаблицаТоваров.ТекущаяСтрока
	
	//ЭтаФорма.Элементы.ТаблицаТоваровПризнакПредметаРасчета.Видимость = Истина;
	
	//Для Каждого СледТовар Из ЭтаФорма.Элементы.ТаблицаТоваров Цикл
	//	
	//	СледТовар.ПризнакПредметаРасчета = СледТовар.ПризнакПредметаРасчета;
	//КонецЦикла;

	УдалитьНастройку("ПечатьЧека_ПриСозданииНаСервере");
	ЗаполнитьТаблицуОплат();	
	ОбновитьПредставлениеЧека();
КонецПроцедуры





