&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	Договор = Параметры.ДоговорКонтрагента;
	Основание = Параметры.Основание;    
	ДатаПлатежа = Параметры.ДатаПлатежа;
	СуммаОплат =  Параметры.СуммаОплат;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Документ
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоступлениеТоваровУслуг.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДокументыПоступления.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры
	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицу();
	Если ДокументыПоступления.Количество()<1 Тогда
		Элементы.Группа1.Видимость = Ложь;
	Иначе
		Элементы.Группа1.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ЗаполнитьДокумент()   
	
	
	
	
	
	КВозврату = Новый Структура;
	КВозврату.Вставить("ВидОперации",Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги);  
	КВозврату.Вставить("Организация",Основание.Организация);
	КВозврату.Вставить("Склад",Основание.Склад);//Справочники.Склады.НайтиПоНаименованию("Основной склад");
	КВозврату.Вставить("Контрагент",Договор.Владелец);
	КВозврату.Вставить("ДоговорКонтрагента",Договор);
	КВозврату.Вставить("СпособЗачетаАвансов",Перечисления.СпособыЗачетаАвансов.Автоматически);
	//СчетаРасчетовСКонтрагентом = БухгалтерскийУчётПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Договор.Организация,Договор.Владелец,Договор);
	КВозврату.Вставить("СчетУчетаРасчетовСКонтрагентом",Основание.СчетУчетаРасчетовСКонтрагентом);
	КВозврату.Вставить("СчетУчетаРасчетовПоАвансам",Основание.СчетУчетаРасчетовПоАвансам);   
	КВозврату.Вставить("ВалютаДокумента",Основание.ВалютаДокумента);         
	//КВозврату.Вставить("Ответственный",ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	КВозврату.Вставить("КратностьВзаиморасчетов",Основание.КратностьВзаиморасчетов);
	КВозврату.Вставить("КурсВзаиморасчетов",Основание.КурсВзаиморасчетов);
	КВозврату.Вставить("НДСВключенВСтоимость",Основание.СуммаВключаетНДС);
	КВозврату.Вставить("СуммаВключаетНДС",Основание.СуммаВключаетНДС);
	КВозврату.Вставить("СуммаДокумента",Основание.СуммаДокумента);
	КВозврату.Вставить("СчетУчетаРасчетовСКомиссионером",Основание.СчетУчетаРасчетовСКонтрагентом);       
	КВозврату.Вставить("Дата",ДатаПлатежа);  
	КВозврату.Вставить("Основание",Основание);      
	КВозврату.Вставить("СуммаОплат",СуммаОплат);      
	

		
	

	//Док = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();  
	//Док.Заполнить(КВозврату);
	//ФормаДок = Док.ПолучитьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаУслуги");
	//ФормаДок.Открыть();

	//НовСтр = Док.Услуги.Добавить();  
	
	//НовСтр	
	
	
	//Док.ЗаполнитьСчетаРасчетовСКомитентами();
	//Док.Записать(РежимЗаписиДокумента.Запись);
	Возврат КВозврату;
КонецФункции

&НаКлиенте
Процедура СоздатьНовый(Команда)
	Парам = ЗаполнитьДокумент();       
	ПараметрыФормы = Новый Структура("Основание", Парам); 
	ЭтаФорма.Закрыть();                      
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокументаУслуги", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
	//ЭтаФорма.Закрыть();
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Ключ",ДокументыПоступления[ВыбраннаяСтрока].Документ); 
	//ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаОбъекта",ПараметрыФормы);
	
	//ДокументыПоступленияВыборНаСервере(ВыбраннаяСтрока);
КонецПроцедуры
